{
	"courses" : [	
		{
			"Name" : "Automated Reasoning",
			"Code" : "INFR09042",
			"Credits" : "10",
			"Level" : "09",
			"Year" : "3",
			"Average" : "60.15",
			"Area" : "Artificial Intelligence",
			"Prerequisites" : ["Informatics 2D - Reasoning and Agents"],
			"Feedback" : ["I would recommend it, as long as you're prepared to sit down and spend some time making sure you know how to use Isabelle", 
						  "IT'S A PAINFUL COURSE, DON'T DO IT UNLESS YOU REALLY LIKE ASSISTED THEOREM PROVING AND LOGIC",
						  "This course will be painful, if you are not interested in Logic, Math and programming. Honestly, don't take it, unless you are interested in those three. However, if you are, this is possibly the best course for you.",				  
						  "Work constantly on the material as its being taught and make sure you understand and try to solve all the tutorial questions. That way you will not find any problem dealing with the course. Otherwise you might struggle with it, especially with the coursework",
						  "Worth the challenge."]
		},
		{
			"Name" : "Computer Design",
			"Code" : "INFR09046",
			"Credits" : "20",
			"Level" : "09",
			"Year" : "3",
			"Average" : "77.63",
			"Area" : "Architecture",
			"Prerequisites" : [],
			"Feedback" : ["Content was interesting and the coursework was a great way to enhance the overall understanding of the study material. The exercise sheets and provided answers were also very helpful, since they gave an idea of potential exam questions. The lecturer is very good at explaining the content and was really helpful during labs - sometimes stayed well beyond the lab finish time to help us with the coursework. Overall, a really good course and one of the best lecturers I have had at uni so far",
						  "Excellent lecturer, very clear and explained things extremely well, both in lectures and tutorials. Interesting and engaging course."]
		},
		{
			"Name" : "Foundations of Natural Language Processing",
			"Code" : "INFR09028",
			"Credits" : "10",
			"Level" : "09",
			"Year" : "3",
			"Average" : "81.52",
			"Area" : "Artificial Intelligence",
			"Prerequisites" : ["Informatics 2A - Processing Formal and Natural Languages"],
			"Feedback" : ["It’s a very easy course but essential to your development as a Computer Scientist. You will understand everything even better if you also take IAML",
						  "This course is excellent, take it and enjoy it. The workload is pretty fair in my opinion and the assignments are posted well in advance. Go to the lectures, they are both useful and really engaging.",
						  "This course taught you foundations about NLP, very good introductory course.",
						  "Lectures are great, but don't teach you how to code the assignments at all. That's expected, but the lab leaders also did not help with coding very much, so unless you know Python very well already the assignments were difficult.",
						  "Take it. It’s great."]
		},
		{
			"Name" : "Introduction to Vision and Robotics",
			"Code" : "INFR09019",
			"Credits" : "10",
			"Level" : "09",
			"Year" : "3",
			"Average" : "63.65",
			"Area" : "Artificial Intelligence",
			"Prerequisites" : [],
			"Feedback": [" Don't. If you're unlucky enough to have signed up for this course, drop it as soon as you can. You'll do better and learn more if you jump into any other course half way through the semester.",
						 "START THE COURSEWORK EARLY!!!!",
						 "Take this course only if you have decent maths and physics",
						 "Take your time to go through the equations on the slides and make sure you understand them. It is too late to start paying attention to them once you start working on the coursework.",
						 "Focus on the Labs for this course, which are helpful for both lectures and assignment."]
		},
		{
			"Name" : "Operating Systems",
			"Code" : "INFR09047",
			"Credits" : "20",
			"Level" : "09",
			"Year" : "3",
			"Average" : "71.63",
			"Area" : "Architecture",
			"Prerequisites" : [],
			"Feedback" : ["Go for it, both the lectures and the coursework are quite enjoyable. Make sure you read the coursework assignments while well rested. It is somewhat difficult to understand at first but once you do, the implementation is reasonably straightforward.",
						  "It's easy to follow and understand.",
						  "Quite interesting and very good lecturers!",
						  "Recommended.",
						  "Start the assignments early."]
		},
		{
			"Name" : "System Design Project",
			"Code" : "INFR09032",
			"Credits" : "20",
			"Level" : "09",
			"Year" : "3",
			"Average" : "71.09",
			"Area" : "Artificial Intelligence",
			"Prerequisites" : [],
			"Feedback" : ["I am really sorry for you! Hope it ends well! Pray for a team with decent people!",
						  "Do not take this course. It is one of the worst-run and most stressful courses in Informatics.",
						  "Although it’s an Informatics course, be prepared to do a lot of work in terms of organization, team management, writing documentation and etc. Useful if you don't have any industry experience. However, if you have experience and it's not compulsory for you, think twice before taking this course (its loads of work)",
						  "Find good ways of dealing with stress because this course will be a lot of stress."]
		},
		{
			"Name" : "Algorithms and Data Structures",
			"Code" : "INFR10052",
			"Credits" : "10",
			"Level" : "10",
			"Year" : "3",
			"Average" : "72.26",
			"Area" : "Algorithms and Data Structures",
			"Prerequisites" : ["Informatics 2B - Algorithms, Data Structures, Learning", "Probability with Applications", "Discrete Mathematics and Mathematical Reasoning"],
			"Feedback" : ["Attend all lectures and tutorials because it is WORTH IT",
						  "Do not take this course",
						  "Don't go to lectures. Read the book instead.",
						  "Prepare for boring lectures haha",
						  "The course is hard if you do not like proofs, but I found it really interesting and I learnt some new algorithms. It is really useful if you want to improve your algorithmic knowledge, but be prepared to be challenged. Bear in mind that you mind have to do some individual studying to actually understand."]
		},
		{
			"Name" : "Computational Cognitive Science",
			"Code" : "INFR10054",
			"Credits" : "10",
			"Level" : "10",
			"Year" : "3",
			"Average" : "58.80",
			"Area" : "Artificial Intelligence",
			"Prerequisites" : [],
			"Feedback" : ["Don't skip the lectures, can be difficult to catch up from just the slides.",
						  "It is a challenging yet very nice introduction to the area. Warning: There is a lot of probabilistic theories/concepts/thinking involved, turning theories from psychology into computational models is assumption- and maths-heavy :-)",
						  "Refresh your probability and calculus knowledge before starting this course! It's a fairly gentle course if you keep up with the lectures and tutorials and the recommended textbook is fantastic for supplementing these.",
						  "Be prepared that this course is rather challenging but do not be scared to actually open up because once you're through the worst bit it actually all starts making sense."]
		},
		{
			"Name" : "Computer Communications and Networks",
			"Code" : "INFR10074",
			"Credits" : "20",
			"Level" : "10",
			"Year" : "3",
			"Average" : "70.58",
			"Area" : "Networks",
			"Prerequisites" : [],
			"Feedback" : ["It is an interesting course but it is full of theory. A lot of material to learn",
						  "The second coursework is a lot harder than the first and worth a lot more, so keep that in mind.",
						  "Very interesting if keen to learn about networks. Not very demanding but do attend the lectures, you miss a lot of information and tips if you don't",
						  "This course teaches very helpful material"]
		},
		{
			"Name" : "Computer Security",
			"Code" : "INFR10067",
			"Credits" : "20",
			"Level" : "10",
			"Year" : "3",
			"Average" : "70.87",
			"Area" : "Security and Cryptography",
			"Prerequisites" : [],
			"Feedback" : ["Attend all the lectures as they are very informative.",
						  "Be prepared to be intellectually challenged and do the readings before each lecture otherwise you will understand only half of it.",
						  "It is not an easy course. It is important to do the reading.",
						  "It's a fun and good course, but be prepared to study a lot of cryptography and discrete",
						  "Quite challenging but really fun, would recommend",
						  "It will be challenging but rewarding, prepare to work hard and feel proud at the end"]
		},
		{
			"Name" : "Database Systems",
			"Code" : "INFR10070",
			"Credits" : "20",
			"Level" : "10",
			"Year" : "3",
			"Average" : "68.56",
			"Area" : "Databases",
			"Prerequisites" : [],
			"Feedback" : ["Do take it if you're interested in databases and want to learn SQL. You'll learn both so make sure you're comfortable with learning the theory behind databases.",
						  "Go for it, especially if you finally understood Computational Logic at the end of first semester first year and if you enjoyed INF2D -Agents and Reasoning",
						  "It's a really good course if you don't know much about SQL. If you already know plenty, it might not be able to teach you a lot.",
						  "Would recommend; workload is reasonable and at a good level",
						  "Continuously study, ask for help as soon as you need it and don't wait, and start early on the homework."]
		},
		{
			"Name" : "Compiling Techniques",
			"Code" : "INFR10065",
			"Credits" : "20",
			"Level" : "10",
			"Year" : "3",
			"Average" : "78.95",
			"Area" : "Programming Language",
			"Prerequisites" : [],
			"Feedback" : ["Be prepared to work a lot and work hard. The content is by no means challenging but does require rigorous and careful thinking.",
						  "Get started with writing a compiler as soon as possible. A lot of work.",
						  "Start the work early and be very careful and thorough when you do.",
						  "Depending on how fast and good a coder you are, you might find this course moderately easy or challenging"]
		},
		{
			"Name" : "Introductory Applied Machine Learning",
			"Code" : "INFR10069",
			"Credits" : "20",
			"Level" : "10",
			"Year" : "3",
			"Average" : "67.49",
			"Area" : "Artificial Intelligence",
			"Prerequisites" : [],
			"Feedback" : ["Be prepared to learn on your own and definitely check Coursera for a very similar course. Also do all the labs and coursework in a timely manner and studying for the exam will be a piece of cake",
						  "Definitely a demanding course but exciting and lets you practice all the interesting stuff you learned.",
						  "Is a good introductory course. However, expect to spend a lot of time on the assignments.",
						  "It is a fast paced course. Make sure you know some machine learning before getting into this course",
						  "It's a great practical course for ML."]
		},
		{
			"Name" : "Introduction to Theoretical Computer Science",
			"Code" : "INFR10059",
			"Credits" : "10",
			"Level" : "10",
			"Year" : "3",
			"Average" : "72.74",
			"Area" : "Theory of Computation",
			"Prerequisites" : [],
			"Feedback" : ["Do the coursework as the semester progresses - it makes it a lot more manageable, and the questions roughly correspond to material taught each week",
						  "Hard work if you're not already proficient at this type of thing but worth it.",
						  "Mathematics and proofs heavy, but extremely well explained so that even if you're struggling you're unlikely to fall behind, would recommend.",
						  "Read the notes! They are good! And do the coursework as soon as you can!"]
		},
		{
			"Name" : "Professional Issues",
			"Code" : "INFR10022",
			"Credits" : "10",
			"Level" : "10",
			"Year" : "3",
			"Average" : "68.09",
			"Area" : "Theory and Ethics",
			"Prerequisites" : [],
			"Feedback" : ["Don't", "Not a particularly interesting course but necessary.", "The course is a lot more relevant than you think. So pay attention because the information will come handy in the future.",
						  "You will not want to go to all the lectures because some of them are quite useless (for example teaching you how to spell...) but the guest lectures are refreshing and quite interesting"]
		},
		{
			"Name" : "Software Testing",
			"Code" : "INFR10057",
			"Credits" : "10",
			"Level" : "10",
			"Year" : "3",
			"Average" : "76.62",
			"Area" : "Software Engineering",
			"Prerequisites" : ["Informatics 2C Computer Systems OR Informatics 2C Software Engineering"],
			"Feedback" : ["It's a nice course. Take it if you like. :-)",
						  "Just take, it's useful, quite easy and the exam is open book",
						  "Many of the software testing approaches may seem intuitive and even obvious but I highly recommend taking the course simply to gain the useful confidence that will pay off in any software engineering interview or job.",
						  "This course is worth taking if you are interested in software testing methods and concepts.",
						  "I liked the professor's explanations, and found everything fairly straightforward."]
		}
	]
}