[
{"courseName": "Accelerated Natural Language Processing", "EUCLID Code": "INFR11125", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11125.htm", "Acronym": "ANLP", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Sharon Goldwater", "Summary": "The course will synthesize ideas from linguistics and computer science to provide students with a fast-paced introduction to the field of natural language processing. The course will cover the most widely-used theoretical and computational models of language, including both statistical and nonstatistical approaches. The course will familiarize students with a wide range of linguistic phenomena with the aim of appreciating the complexity, but also the systematic behaviour of natural languages like English, the pervasiveness of ambiguity, and how this presents challenges in natural language processing. In addition, the course introduce the most important algorithms and data structures that are commonly used to solve many NLP problems.\n\nThe course will cover formal models for representing and analyzing the syntax and semantics of words, sentences, and discourse. Students will learn how to analyse sentences algorithmically, using hand-crafted and automatically induced treebank grammars, and how to build interpretable semantic representations. The course will also cover a number of standard models and algorithms that are used throughout language processing. Examples include n-gram and Hidden Markov Models, the EM algorithm, and dynamic programming algorithms such as chart parsing.\n\n**This course replaces INFR11059 Advanced Natural Language Processing**", "Description": "Part I: Words\n\n* Inflectional and derivational morphology\n\n* Finite state methods and Regular expressions\n\n* Word Classes and Parts of speech\n\n* Sequence Models (n-gram and Hidden Markov models, smoothing)\n\n* The Viterbi algorithm, Forward Backward, EM\n\n\n\nPart II: Syntax\n\n* Syntactic Concepts (e.g., constituency, subcategorisation, bounded and unbounded dependencies, feature representations)\n\n* Analysis in CFG - Greedy algorithms---Shift-reduce parsing\n\n* Divide-and-conquer algorithms---CKY\n\n* Chart parsing\n\n* Lexicalised grammar formalisms (e.g., TAG, CCG, dependency grammar)\n\n* Statistical parsing (PCFGs, dependency parsing)\n\n\n\nPart III: Semantics, Discourse, Dialogue and Applications\n\n* logical semantics and compositionality\n\n* Semantic derivations in grammar\n\n* Lexical Semantics (e.g., word senses, semantic roles)\n\n* Discourse and dialogue (e.g., anaphora, speech acts)\n\n* Text classification and sentiment analysis\n\n* Other applications (e.g., machine translation, question answering)\n\n\n\nMethodological topics, interspersed throughout:\n\n* Issues in annotation and evaluation\n\n* Machine learning approaches (e.g., Maximum Entropy models, neural networks)\n\n\n\nRelevant QAA Computing Curriculum Sections: Not yet available"},
{"courseName": "Advanced Parallel Techniques", "EUCLID Code": "INFR11170", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11170.htm", "Acronym": "EPCC/02", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "The majority of current HPC applications are parallelised using a combination of message-passing (the MPI library) or threading (OpenMP directives). As HPC systems grow in size and complexity, other software approaches are now being used to aid performance portability, scalability and maintainability.\n\n\n\nThis course will cover a range of more advanced and upcoming technologies for parallel computing. Key paradigms include:\n\n- programming of accelerators including graphics processing units (GPUs);\n\n- threading approaches other than OpenMP;\n\n- partitioned global address space (PGAS) approaches;\n\n- programming languages important in HPC; and,\n\n- understanding how to select the appropriate techniques given the problem and hardware at hand.", "Description": "Example of topics that will be covered include:\n\nLanguages: modern C++, Python (and interfacing with compiled code)\n\nThreading: pthreads, C++ & boost threads, Intel TBB\n\nAccelerators/GPUs: CUDA, OpenCL, OpenMP target directives, OpenACC\n\nPGAS: Fortran coarrays, OpenSHMEM, MPI single sided"},
{"courseName": "Algorithms and Data Structures", "EUCLID Code": "INFR10052", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10052.htm", "Acronym": "ADS", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "10", "Points": "10", "Year": "3", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Richard Mayr", "Summary": "The course aims to provide general techniques for the design of efficient algorithms and, in parallel, develop appropriate mathematical tools for analysing their performance. In this, it broadens and deepens the study of algorithms and data structures initiated in INF2. The focus is on algorithms, more than data structures. Along the way, problem solving skills are exercised and developed.", "Description": "Introductory concepts\n\nReview of CS2. Models of computation; time and space complexity; upper and lower bounds, big-O and big-Omega notation; average and worst case analysis.\n\n\n\nDivide and conquer\n\nMatrix multiplication: Strassen's algorithm; the discrete Fourier transform (DFT), the fast Fourier transform (FFT). Expressing the runtime of a recursive algorithm as a recurrence relation; solving recurrence relations.\n\n\n\nSorting\n\nQuicksort and its analysis; worst-case, best-case and average-case.\n\n\n\nData structures: Disjoint sets\n\nThe ``disjoint sets'' (union-find) abstract data type: specification and implementations as lists and trees. Union-by-rank, path-compression, etc., ``heuristics''. Applications to finding minimum spanning trees.\n\n\n\nDynamic programming\n\nIntroduction to the technique; examples: Matrix-chain multiplication, Longest common subsequences.\n\n\n\nGraph/Network algorithms\n\nNetwork flow, Max-flow/min-cut theorem, Ford-Fulkerson algorithm.\n\n\n\nGeometric algorithms\n\nConvex hull of a set of points (in 2-d).\n\n\n\nRelevant QAA Computing Curriculum Sections: Data Structures and Algorithms"},
{"courseName": "Algorithmic Foundations of Data Science", "EUCLID Code": "INFR11156", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11156.htm", "Acronym": "AFDS", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "He Sun", "Summary": "The course aims to introduce algorithmic techniques that form the foundations of processing and analysing massive datasets of various forms. In particular, the course discusses how to pre-process massive datasets, efficiently store massive datasets, design fast algorithms for massive datasets, and analyse the performance of designed algorithms. Through various examples and the coursework, the students will see applications of the topics discussed in class in other areas of computer science, e.g., machine learning, and network science.", "Description": "The course is to discuss algorithmic techniques that form the foundations of processing and analysing massive datasets of various forms. Specific techniques covered in the course include effective representation of datasets, extracting useful information from a dataset based on algebraic tools, designing faster algorithms based on sampling and sketching techniques. Students in class will learn these techniques through intuitions, theoretical reasoning, and practical examples.\n\n\n\nThe syllabus includes:\n\nHigh-dimensional spaces\n\nBest-fit subspaces and singular value decomposition\n\nSpectral algorithms for massive datasets\n\nData streaming algorithms\n\nClustering\n\nGraph sparsification"},
{"courseName": "Advanced Vision", "EUCLID Code": "INFR11031", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11031.htm", "Acronym": "AV", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May; April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Bob Fisher", "Summary": "This module aims to build on the introductory computer vision material taught in Introduction to Vision and Robotics. The main aim is to give students an understanding of main concepts in visual processing by constructing several vision systems during the course of the lecture series and practicals.", "Description": "In the course of constructing six vision systems, students will learn about: image noise reduction, region growing, boundary segmentation, Canny edge detector, Hough transform, RANSAC, 2D and 3D coordinate systems, interpretation tree matching, rigid 2D object modeling, 2D position estimation, point distribution models, 3D range sensors, range data segmentation, 3D position estimation, stereo sensors, motion tracking and various approaches to object recognition.  Students are also introduced to ethical issues that might arise when using image analysis technology.\n\n\n\nThe activities of the module are designed to further develop intellectual skills in the areas of: laboratory, writing (lab reports and short essays), teamwork, critical analysis, programming and laboratory skills.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Computer Vision and Image Processing"},
{"courseName": "Algorithmic Game Theory and its Applications", "EUCLID Code": "INFR11020", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11020.htm", "Acronym": "AGTA", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Kousha Etessami", "Summary": "Game theory is the formal study of interaction between \"self-interested\" (or \"goal-oriented\") \"systems\" (or \"agents\" or \"decision makers\" or \"players\"), & strategic scenarios that arise in such settings. It began life in Economics in the 1940's with the work of von Neumann & Morgenstern, but has since been applied to an extraordinary range of subjects, including political science, evolutionary biology & even to inspection regimes for arms control. \n\n\n\nGame theory has for years also played an important, if less recognized, role in several branches of computer science. Applications within computer science include the use of games in automated verification & model checking to model computing systems in an unknown and possibly adverse environment. In AI games are applied to the analysis of multi-agent systems. Recently, with the advent of the internet and e-commerce, many game theoretic questions in the interplay between economics & computing have received extensive attention. These include electronic auctions, & more generally mechanism design questions (inverse game theory) related to finding incentive structures for cooperation between independent entities on the internet. \n\n\n\nWherever game theory plays a quantitative role, algorithmic and computational questions related to \"solving\" games are also of central importance. \n\n\n\nThis course aims to bring together as a coherent body of knowledge the game theoretic algorithms & models that underpin several flourishing subjects at the intersection of computer science, economics and e-commerce, & AI.", "Description": "*  Examples of diverse games.\n\n* Zero-sum two-person games: LP, simplex, LP-duality, mixed strategies and the minimax theorem.\n\n* General games in strategic form:\n\n   o Equilibria and Nash's theorem.\n\n   o 2-player equilibria: Lemke-Howson algorithm and its variants. \n\n* Games in Extensive form (mainly zero-sum, perfect information):\n\n   o Game trees. Relation to Strategic games.\n\n   o And/Or game graphs and reachability games.\n\n   o bisimulation, simulation, parity games, and other omega-games on        automata(finitely presented, infinite duration games).\n\n   o mean value games, MDPs, and stochastic games. \n\n* Mechanism design and inverse game theory: designing games where selfish players will behave as desired.\n\n   o Vickery auctions and other mechanisms.\n\n   o Combinatorial auctions.\n\n   o Incentive structures for the internet. \n\n\n\nRelevant QAA Computing Curriculum Sections:  Artificial Intelligence, Data Structures and Algorithms, e-commerce, Simulation and Modelling, Theoretical Computing"},
{"courseName": "Advances in Programming Languages", "EUCLID Code": "INFR11101", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11101.htm", "Acronym": "APL", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "VUG: December; April/May", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Ian Stark", "Summary": "This course surveys recent developments in programming language design and implementation with an emphasis on those developments which are technological advances on the state-of-the-art.", "Description": "Students in APL learn about a range of significant issues in programming language design and implementation. Much of the material is presented in lectures on current topics, supported by additional reading and self-study. Students also learn through a practical exercise where they must individually research a chosen programming language innovation.\n\n\n\nAreas covered include the following.\n\n\n\n* The aims of language design: correctness, uniformity, practicality\n\n* Advanced programming language constructs: overview and motivation\n\n* Specific examples of programming language approaches to different problem domains, generally four or five drawn from areas such as:\n\n\n\n    Concurrency, memory management, security, distribution, parallelism,\n\n    verification, correctness, types, objects, classes, language interworking,\n\n    polymorphism, generics, naming, and modularity.\n\n\n\nRelevant QAA Computing Curriculum Sections: Comparative Programming Languages, Compilers and Syntax Directed Tools, Theoretical Computing"},
{"courseName": "Advanced Topics in Foundations of Databases", "EUCLID Code": "INFR11122", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11122.htm", "Acronym": "ATFD", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "11", "Points": "20", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Andreas Pieris", "Summary": "The course focuses on three central aspects of big data: Volume, Variety and Veracity. It will cover tractability and parallel scalability of querying big data (volume), data models and data interoperability (variety), and foundations of data quality and uncertainty (veracity). It aims to expose students to current research and development in connection with big data theory, and prepare them for conducting research in this emerging area. The course content is dynamic and continuously updated to cover the state-of-the-art in big data theory.", "Description": "* Background: Fundamental challenges introduced by querying big data; the need for revising the classical computational complexity theory in the context of big data; modelling computational costs and communication costs; BD-tractability: the tractability of queries on big data; the challenges to query data residing in multiple sources; the need to study data quality, the other side of big data.\n\n\n\n* Volume: (1) the feasibility of computing exact query answers in big data within our available resources: parallel scalability, scale independence, techniques for making big data small; (2) approximate query answering: (a) query-driven approximation, envelopes with absolute approximation bounds, (b) data-driven approximation, synopsis-based approximate query answering, and (c) resource-bounded approximate query answering and anytime approximation.\n\n\n\n* Variety: data can be in different formats, and come from different sources and/or applications. We shall cover: (a) popular data models, including relational, XML, and graph models, and languages for them, and (b) handling queries over data residing in multiple sources, focusing on both virtual and materialized integration, and efficient query answering.\n\n\n\n* Veracity: big data = data quantity + data quality; (1) central issues of data quality: data consistency, data accuracy, information completeness, data currency (timeliness), entity resolution; (2) improving data quality: consistency query answering, data repairing, certain fixes; (3) knowledge bases as master data, deducing the true values of entities; (4) handling poor quality information, understanding current technologies and their deficiencies, correctness guarantees.\n\n\n\n\n\nBig data is the next frontier for innovation, competition and productivity. This course will cover fundamental issues in connection with three of four big V's in the typical characterization of big data, namely, Volume, Variety and Veracity."},
{"courseName": "Artificial Intelligence, Present and Future", "EUCLID Code": "INFR11180", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11180.htm", "Acronym": "AIPF", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Jacques Fleuriot", "Summary": "AI systems now outperform humans on tasks that were once taken to show great intelligence when undertaken by people (for example, playing chess). How far can this go in the future?  What are the assumptions behind different approaches to AI? What dangers can there be from AI systems, and how should AI practitioners take these into account? The course gives a quick overview of the background and of contemporary work in symbolic AI, and looks at the relationship between statistical and 2 logical approaches to AI. It also addresses some of the philosophical and ethical issues that arise.", "Description": "The course surveys the state of the art in current AI, looking at systems and techniques in various subfields (eg,  agents and reasoning;  planning, constraints and uncertainty; google search and the semantic web; dialogue and machine translation; varieties of learning).\n\n\n\nThroughout, relationships between different approaches to AI will be explored,  especially  the  symbolic/sub-symbolic  split  at  the  representation level. Philosophical and ethical issues in AI issues will be introduced.\n\n\n\nTypical topics include:\n\n\n\nReasoning agents\n\nLogic and inference via Logic Programming\n\nLinked data, semantic net and internet search\n\nMonte Carlo Tree Search\n\nPlanning under uncertainty\n\nAdversarial search, game playing\n\nProbabilistic inference\n\nInductive Logic Programming\n\nNatural language processing, approaches to machine translation\n\nApproaches to machine learning\n\nAI prospects and dangers\n\nEthical and Philosophical issues."},
{"courseName": "Advanced Message-passing Programming", "EUCLID Code": "INFR11169", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11169.htm", "Acronym": "EPCC/01", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "Modern parallel supercomputers are predominantly programmed using the Message-Passing Interface (MPI) library. Learning the basic MPI syntax and writing medium-scale programs is relatively straightforward, but many issues only arise when tackling large-scale problems on thousands of processes. Typical issues include deadlock, poor scalability or inefficient file IO.\n\n\n\nThere are two basic ways to address these issues. The fundamental MPI calls can be used in more sophisticated ways, which requires an in-depth understanding of the finer details of the MPI standard and its implementation in real libraries. Alternatively, different approaches can be used which employ advanced MPI functionality or which exploit the shared-memory nature of modern multicore compute nodes. Before any correctness or performance issues can be addressed they must first be diagnosed, so knowledge of parallel profiling and debugging is essential.", "Description": "The course will cover the following topics:\n\n- Scalability challenges for parallel programs\n\n- MPI Internals\n\n- Parallel profiling and debugging\n\n- Message-passing optimisations\n\n- Advanced communicator management\n\n- Advanced use of MPI collectives\n\n- Hybrid message-passing and shared-memory programming\n\n- Unstructured meshes\n\n- Advanced load-balancing techniques\n\n- Parallel file systems and parallel IO"},
{"courseName": "Advanced Databases", "EUCLID Code": "INFR11011", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11011.htm", "Acronym": "ADBS", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Milos Nikolic", "Summary": "This course aims at furthering database systems concepts through adding complexity and a more hands-on approach. In particular, we will focus on supporting multi-dimensional data in a DBMS, query optimisation, query evaluation, transaction processing and concurrency control in both a centralised and a distributed context. In terms of centralised databases, we shall start from single and multi-dimensional indexing methods, move on to join evaluation algorithms, and talk about query opimisation paradigms. We shall then focus on the issues of transaction processing, concurrency control and crash recovery. Finally, we shall revisit the previous issues in a distributed database environment.", "Description": "This is an overview of what will be covered. The time spent on each part will be adjusted as the course progresses.\n\n\n\n* B-trees, hash-based indexes, R-trees.\n\n* Indexing structures for solid state and main memory.\n\n* Query evaluation: sorting and join processing, aggregation\n\n* Algorithmic adjustments for flash memory and main-memory systems.\n\n* Query optimisation: cost-based query optimisation, dynamic programming, randomised exploration, rule-based optimisation.\n\n* Concurrency and recovery: transactions, lock tables, main-memory concurrency control, recovery using the ARIES algorithm.\n\n* Parallel databases: parallel query evaluation, parallel and distributed transaction processing.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Databases, Data Structures and Algorithms, Software Engineering"},
{"courseName": "Computational Cognitive Science", "EUCLID Code": "INFR10054", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10054.htm", "Acronym": "CCS", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "10", "Points": "10", "Year": "3", "Delivery": "S1", "Exam Diet": "April/May; VUG: December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Christopher Lucas", "Summary": "This course aims to introduce students to the basic concepts and methodology needed to implement and analyse computational models of cognition. It considers the fundamental issues of using a computational approach to explore and model cognition. In particular, we explore the way that computational models relate to, are tested against, and illuminate psychological theories and data.\n\n\n\nThe course will introduce both symbolic and subsymbolic modelling methodologies, and provide practical experience with implementing models. The symbolic part will focus on cognitive architectures,while the subsymbolic part will introduce probabilistic models.", "Description": "- An introduction/review of the idea of computational approaches to studying cognition; the mind as information-processing system; Marr's levels of analysis (computational, algorithmic, implementation).\n\n- The general motivations underlying the computational modelling of cognition, and different kinds of questions that can be answered (e.g., why do cognitive processes behave as they do, or what algorithms might be used to carry out this behaviour? What kinds of information are used, or how is this information processed/integrated over time?)\n\n- Mechanistic/algorithmic approaches and issues addressed by these approaches: parallel versus serial processing, flow of information, timing effects.\n\n- Rational/probabilistic approaches and issues addressed by these approaches: adaptation to the environment, behaviour under uncertainty, learning, timing effects.\n\n- General issues: top-down versus bottom-up processing, online processing, integration of multiple sources of information.\n\n- Methodology and issues in the development and evaluation of cognitive models: Which psychological data are relevant? What predictions are made by a model? How could these be tested?\n\n- Modelling techniques: in the assignments, students will experiment with both symbolic (rulebased) and subsymbolic (probabilistic) cognitive models.\n\n- Example models: in a number of areas we will look at the theories proposed and different ways of modelling them. Areas discussed will include several of the following: language processing, reasoning, memory, high-level vision, categorization. Specific models will be introduced and analysed with regard to relevant psychological data."},
{"courseName": "Computational Cognitive Neuroscience", "EUCLID Code": "INFR11036", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11036.htm", "Acronym": "CCN", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Peggy Series", "Summary": "In this course we study computational approaches to understanding cognitive processes, using massively parallel networks. We study biologically-inspired learning rules for connectionist networks, and their application in connectionist models of perception, memory and language.", "Description": "*Encoding Information in populations of neurons. \n\n*Decoding Information from populations of neurons. \n\n*Models of Neurons and Networks of Neurons. \n\n*Information transmission and Attention. \n\n*Models of Learning and Plasticity. \n\n*Models of Memory. \n\n*Models of Decision Making. \n\n*Models of Mental disorders. \n\n*The Bayesian Brain. \n\n\n\nRelevant QAA Computing Curriculum Sections:  Artificial Intelligence"},
{"courseName": "Introductory Applied Machine Learning", "EUCLID Code": "INFR11182", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11182.htm", "Acronym": "IAML-PG", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "50/50", "Lecturer(s)/Coordinator(s)": "Nigel Goddard", "Summary": "Organisations seek to make better decisions by examining their data with an aim to discovering and/or drawing conclusions about the information contained within. This course is about the principled application of machine learning techniques to extracting information from data. The main area that will be discussed is supervised learning, which is concerned with learning to predict an output, given inputs. A second area of study is unsupervised learning, where we wish to discover the structure in a set of patterns, i.e. there is no output \"teacher signal\". The primary aim is to provide the student with a set of practical tools that can be applied to solve real - world problems in machine learning, coupled with an appropriate, principled approach to formulating a solution.", "Description": "This course is delivered using \"flipped-classroom\" methods. Intellectual content will be delivered via a combination of online short video segments (overall, per topic, approximately the same length as a traditional lecture). Some of the topics have online quizzes associated with them, intended for you to review your understanding. During most of the lecture slots we will have other activities to review the topic material, also available by online recording.\n\n\n\nWe expect to cover the following general areas:\n\n\n\n1. Review of maths and probability\n\n2. Feature engineering (e.g., basis transforms, selection , Principal Components Analysis)\n\n3. Classification vs. Regression\n\n4. Supervised methods (e.g., Naive Bayes, Decision Trees and Random Forests, Linear & Logistic Regression, Support Vector Machines, Nearest Neighbours, Neural Networks)\n\n5. Unsupervised clustering methods (e.g., k-Means, Gaussian Mixture Models, Hierarchical Clustering)\n\n\n\nWe will use a modern machine learning programming environment and industry-standard libraries."},
{"courseName": "Compiling Techniques", "EUCLID Code": "INFR10065", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10065.htm", "Acronym": "CT", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "10", "Points": "20", "Year": "3", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Christophe Dubach", "Summary": "This course describes the phases of a modern programming language\n\ncompiler with an emphasis on widely-used techniques. The course project will require students to implement a complete compiler from scratch for a simple programming language, targeting a real machine assembly such as MIPS. Students will also learn about implementing a compiler pass in a\n\nreal compiler framework. \n\n\n\nThis 20 credit course replaces Compiling Techniques (INFR10053) - 10 credit version.", "Description": "* Introduction: structure of a compiler\n\n* Lexical analysis: tokens, regular expressions, Lex\n\n* Parsing: context-free grammars, predictive and LR parsing\n\n* Abstract syntax: semantic actions, abstract parse trees\n\n* Semantic analysis: symbol tables, bindings, type-checking\n\n* Stack frames: representation and abstraction\n\n* Intermediate code: representation trees, translation\n\n* Basic blocks and traces: canonical trees and conditional branches\n\n* Instruction selection: algorithms for selection, RISC and CISC\n\n* Liveness analysis: solution of dataflow equations\n\n* Register allocation: colouring by simplification, coalescing\n\n* Real assembly language: ARM or MIPS\n\n* Advanced Topics may include: automatic parallelisation, popular\n\nopen-source compilers: GCC, LLVM \n\n\n\n\n\nThis 20 credit course replaces Compiling Techniques (INFR10053) - 10 credits."},
{"courseName": "Compiler Optimisation", "EUCLID Code": "INFR11032", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11032.htm", "Acronym": "COPT", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Hugh Leather", "Summary": "This course introduces students to modern techniques in efficient implementation of programming languages. Modern processors and systems are designed based on the assumption that a compiler will be able to effectively exploit architectural resources. This course will examine in detail techniques to exploit instruction level parallelism, memory hierarchy and higher level parallelism. It will examine classic static analysis approaches to these problems and introduce newer feedback directed and dynamic approaches to optimisation. The course work will require students to implement selected optimisations in a research compiler and critically review literature in compiler optimisation.", "Description": "*Compiler Construction, phase order, compilation as optimisation\n\n*Architecture costs: Parallelism and Latency in uni and multi-processors\n\n*Architecture \"independent\" optimisation, dataflow analysis, lattices and fixed points\n\n*Code generation, register allocation and scheduling in superscalar and vliw processors\n\n*High level analysis based on dependence analysis. Intra and inter procedural analysis, whole program analysis.\n\n*High level transformations including linear algebraic formalisation, unimodular transformations and space/time representation\n\n*Automated parallelisation. shared and distributed memory models. Linear algebraic approach to parallelisation.\n\n*Adaptive optimisation: Feedback directed optimisation, iterative compilation, program specialisation and dynamic compilation eg JIT, DBT\n\n*Compiler infrastructure case studies: SUIF, Machine SUIF, JIKES\n\n*Current themes:low power compilation, automatic compiler generation and machine learning.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Compilers and Syntax Directed Tools"},
{"courseName": "Informatics 2C - Introduction to Software Engineering", "EUCLID Code": "INFR08019", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08019.htm", "Acronym": "INF2C-SE", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "10", "Year": "2", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Paul Jackson", "Summary": "This course gives an overview of the engineering of software systems.  It introduces the main activities and concerns of industrial and commercial software engineering, and enables students to go beyond programming towards software engineering in their own work.", "Description": "The aim is to understand and execute the process of building software systems. The process will entail capturing requirements as use-cases, modelling the system using class and sequence diagrams, implementing the system using Java and running requirements-based tests and system level tests. Beyond the construction process itself, some important surrounding concerns are\n\nintroduced including: satisfying non-functional requirements, building good human interfaces, and considering various software licensing models.\n\n\n\nThe core topics covered, all at introductory level, in this course are:\n\n* Software engineering as a discipline: history, professionalism, ethics\n\n* Software engineering activities: requirements capture; design; implementation; testing, debugging\n\nand maintenance; software process management.\n\n* Modelling in UML (use cases, class diagrams, sequence diagrams).\n\n* Design principles and their influence on maintainability of software.\n\n* Software configuration management.\n\n* Verification, validation and testing.\n\n* Software usability and HCI issues.\n\n* Economic and social aspects of software ownership, patents and licensing.\n\n* Software quality assurance.\n\n\n\nSome further topics will also be covered, depending on topicality and lecturer's expertise. These might include, for example:\n\n* Model-driven development: how to use UML for construction, not just description, of systems\n\n* Software in the world: embedded systems, web services, cloud computing, autonomous computing and other means of delivering functionality\n\n* Agile software development."},
{"courseName": "Masters Dissertation (Design Informatics)", "EUCLID Code": "INFR11097", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11097.htm", "Acronym": "MDI", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "60", "Year": "5", "Delivery": "FLEX", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Maria Wolters", "Summary": "The goal of this course is to make something new, that makes work, care or play better, by designing with data. The dissertation reports an in depth investigation of a significant problem in Design Informatics, according to sound scientific, engineering and design principles.", "Description": "Project dependent.\n\n\n\n\n\nThis is a major piece of full-time independent work which occupies the final months of the MSc course. If taken as part of a one-year masters, it accounts for all of a student's time following their course exams. If taken as part of a two-year masters, it accounts for 1/3 of student time during Semester 1 of Year 2, and 2/3 of student time in Semester 2 of Year 2. It allows students to demonstrate their ability to organise and carry out a substantial investigation into a problem in Design Informatics, according to sound scientific, engineering and design principles. The project involves both the application of skills learnt in the past and the acquisition of new skills. The project often involves the construction of an artefact, whether software, hardware, a robotic device, some other artefact incorporating computation, or some combination of these.\n\n\n\nThe types of activity involved in each project vary but include most of the following:\n\n- Researching the literature and gathering background information.\n\n- Analysing requirements, comparing alternatives and specifying a solution.\n\n- Analysing and exploiting relevant theory in novel ways.\n\n- Designing and implementing the solution.\n\n- Experimenting with and evaluating the solution.\n\n- Exploring the solution as part of a product or service.\n\n- Discussing existing results and presenting new research.\n\n- Developing written and oral presentation skills.\n\n\n\nThe project is conducted individually by the student under the supervision of a member of teaching staff.  Students are formed into groups for the purpose of Review Meetings."},
{"courseName": "Machine Learning and Pattern Recognition", "EUCLID Code": "INFR11130", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11130.htm", "Acronym": "MLPR", "AI": "AI", "CG": "CG", "CS": "CS", "SE": null, "Level": "11", "Points": "20", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Iain Murray", "Summary": "Machine learning is a field devoted to developing algorithms that adapt their behaviour to data, providing useful representations of the data and/or predictions. This course covers some fundamental theoretical concepts in machine learning, and common patterns for implementing methods in practice. The intended audience are those wanting the background required to begin research and development of machine learning methods.\n\n\n\nThis is an advanced course. Students should not choose this class without the required background (see \"Other Requirements\" box); students without this background are strongly advised to take a more practical-based course, such as Introduction to Applied Machine Learning (INFR10063).\n\n\n\nThis 20 credit course replaces Machine Learning & Pattern Recognition (Level 11) (INFR11073) - 10 credit course.", "Description": "The precise set of methods and algorithms used to illustrate and explore the main concepts will change slightly from year to year. However, the main topic headings are expected to be fairly stable.\n\n\n\n- Classification and Regression:\n\n       Linear Regression, logistic regression, Bayes classifiers\n\n- Expanded feature representations: \n\n    Basis functions, neural networks, kernel methods\n\n- Generalization, regularization and inference: \n\n    Penalized cost functions, Bayesian prediction, learning theory\n\n- Model selection, pruning and combination: \n\n    Cross-validation, Bayesian methods, sparsifying regularizers, ensemble methods.\n\n- Representation and metric learning: \n\n    dimensionality reduction, clustering, feature learning\n\n\n\nTo support these topics we will also cover:\n\n- Optimization and Inference algorithms: \n\n    Stochastic gradient descent, simple Monte Carlo ideas, and more specialized methods as required.\n\n\n\n Practical issues: \n\n- Formulating problems as machine learning, adapting methods to fit problems. \n\n- Numerical and programming issues important for machine learning.\n\n- Ethical issues, such as responsible application of methods and privacy concerns."},
{"courseName": "Machine Learning Practical", "EUCLID Code": "INFR11132", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11132.htm", "Acronym": "MLP", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "20", "Year": "4", "Delivery": "YR", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Pavlos Andreadis", "Summary": "This course is focused on the implementation and evaluation of machine learning systems, and is lab-based. Students who do this course will obtain experience in the design, implementation, training, and evaluation of machine learning systems.\n\nSemester one comprises lectures, labs, and individual coursework.  Semester two is based around small group projects, and also includes tutorials and guest lectures.\n\n\n\nThis 20 credit course replaces INFR11119 Machine Learning Practical (10 credits).\n\n\n\nNote: this course is not a stand-alone introduction to machine learning. Please see Other Requirements for details.", "Description": "The course covers practical aspects of machine learning, and will focus on practical and experimental issues in deep learning and neural networks. Topics that are covered include:\n\n\n\n* Feed-forward network architectures\n\n* Optimisation and learning rules \n\n* Regularisation and normalisation\n\n* Neural networks for classification\n\n* Autoencoders\n\n* Convolutional Neural Networks\n\n* Recurrent Neural Networks\n\n\n\nMLP is coursework-based, with lectures to support the additional material required to carry out the practical. Students who complete this course will have experience in the design, implementation, training, and evaluation of machine learning systems.\n\n\n\nMLP is a two-semester course.  During semester 1 the course will focus on developing a deep learning framework based on experiments using the task of classification of handwritten digits using the well-known MNIST dataset. The course uses a Python software framework, and a series of Jupyter notebooks. There is a series of ten weekly lectures in semester 1 to provide the required theoretical support to the practical work.\n\n\n\nSemester 2 will be based on small group projects, with a focus on using deep neural networks within the context of a miniproject, using an open source toolkit such as TensorFlow or PyTorch. Lectures in semester 2 will support the coursework, and also provide insights to the current state of the art in this very fast moving area."},
{"courseName": "MSc by Research Thesis (Pervasive Parallelism)", "EUCLID Code": "INFR11109", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11109.htm", "Acronym": "RTPP", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "140", "Year": "5", "Delivery": "YR", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Murray Cole", "Summary": "Under the guidance of the supervisor, the student conducts a program of independent research in an area of Pervasive Parallelism, and writes an extended dissertation on the topic. The dissertation must demonstrate a critical survey of knowledge in the field, a capability for pursuing research and a satisfactory plan for a more advanced research project, presented in a critical and scholarly way.", "Description": "Project dependent."},
{"courseName": "Operating Systems", "EUCLID Code": "INFR09047", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09047.htm", "Acronym": "OS", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "9", "Points": "20", "Year": "3", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Michael O'Boyle", "Summary": "This course provides an introduction to the design and implementation of general purpose multi-tasking operating systems. It concentrates on the kernel aspects of such systems with the emphasis being on concepts which lead to practical implementations. Throughout the course reference is made to a number of significant actual operating systems (Linux, Windows variants etc.) to illustrate real implementations.\n\n\n\nThis 20 credit course replaces INFR09015 - Operating Systems (10 credits).", "Description": "Process management\n\n*The process concept, synchronisation, mutual exclusion, semaphores and monitors. Threads. Inter-process communication.\n\n\n\nResource Allocation\n\n*Deadlock prevention, avoidance and detection.\n\n\n\nThe OS Kernel\n\n*Micro and Monolithic kernels. Multi-tasking, privilege, interrupt handling. System and user processes. System calls.\n\n\n\nMemory Management\n\n*Description of problems of allocation, protection and sharing. Virtual Physical memory mapping schemes.\n\n*Segmented paged virtual memory. Paging control, replacement algorithms; the working set model. Sharing code and data.\n\n\n\nTime Management\n\n*CPU scheduling algorithms. Real-time scheduling. Disc access scheduling.\n\n\n\nFile Management\n\n*Naming and Directory schemes. Disc space allocation. File protection and access control. System security.\n\n\n\nOther Topics\n\n*Various additional topics may be included from year to year.\n\n\n\nRelevant QAA Computing Curriculum Sections: Operating Systems"},
{"courseName": "Numerical Algorithms for High Performance Computing", "EUCLID Code": "INFR11174", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11174.htm", "Acronym": "EPCC/11", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "The development of High Performance Computing (HPC) systems has been largely driven by the requirements of Computational Scientists running large-scale numerical simulations such as global weather forecasting or studying new materials at the atomic scale. This course covers some of the basic numerical algorithms and computational patterns used in HPC and how they are implemented and used in practice, including the use of standard packages and libraries. Where appropriate, reference will be made to parallel implementations.\n\n\n\nAll these algorithms operate on real-valued variables, not integers, so it is important to understand the issues around storing and working with floating-point numbers, including the errors that this can introduce. This is an applied course and running the algorithms in practical situations is a key component.", "Description": "The course will cover:\n\n- Computational science as the third methodology\n\n- Basic numerics, floating-point representation, errors and exceptions\n\n- Simple ordinary differential equations\n\n- N-body / particle methods\n\n- Dense linear algebra, algorithms and libraries\n\n- Partial differential equations and boundary value problems\n\n- Sparse linear algebra\n\n- Initial value problems and implicit methods\n\n- Spectral methods - Fast Fourier Transforms (FFTs) and applications\n\n- Monte Carlo methods"},
{"courseName": "Neural Information Processing", "EUCLID Code": "INFR11035", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11035.htm", "Acronym": "NIP", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Matthias Hennig", "Summary": "This course builds one recent insights that in many cases the computation done by the nervous system can be described in machine learning terms and using information theory. This course focusses on the more mathematical models of the brain and sensory processing. The solutions found by the nervous system might transfer to engineering applications such as compression, parallel processing, and dealing with complex data.", "Description": "*Neural coding: reverse correlation, higher order kernels, stimulus reconstruction. Application to the fly visual system.\n\n*Information theory as applied to neural coding: mutual information measures, whitening. Application to retinal and LGN coding.\n\n*Networks based on information-theoretic cost functions: Helmholtz machine, Linsker's info-max principle. Application to V1 coding.\n\n*Independent Component Analysis. Basics, variants of ICA, ICA as model for visual cortex.\n\n*Predictive Coding: Kalman filters. Application to cortical coding\n\n*Bayesian approaches: Stimulus estimation, probabilistic interpretation of populations codes.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Simulation and Modelling, Artificial intelligence"},
{"courseName": "Neural Computation", "EUCLID Code": "INFR11162", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11162.htm", "Acronym": "NC", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Matthias Hennig", "Summary": "**This course replaces Neural Computation (INFR11008)**\n\n\n\nThis module aims to examine:\n\n\n\nHow the brain computes and processes information from the outside world.\n\n\n\nHow the brain wires up and how it stores information.\n\n\n\nWe will study the brain at a fairly low level, so that we can make contact with neurophysiological data. We will show the necessary biological data and how it can be described in mathematical terms. We will present modelling methods applicable to various levels of organisation of the nervous system (e.g. single cells, networks of cells). We discuss models of particular brain subsystems.\n\n\n\nIn the practical session we use Matlab and NEURON to simulate the models (No familiarity with NEURON required, some self study of Matlab is beneficial.)", "Description": "*Introduction and overview of the brain\n\n*The neuron\n\n*Biophysical and reduced models of neurons\n\n*Synapses\n\n*Computation and coding in the brain\n\n*Networks of neurons\n\n*Early and higher visual processing\n\n*Network-level modelling\n\n*Plasticity and learning\n\n\n\nRelevant QAA Computing Curriculum Sections: Simulation and Modelling, Artificial intelligence"},
{"courseName": "Probabilistic Modelling and Reasoning", "EUCLID Code": "INFR11134", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11134.htm", "Acronym": "PMR", "AI": "AI", "CG": "CG", "CS": "CS", "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Michael Gutmann", "Summary": "When dealing with real world data, we often need to deal with uncertainty. For example, short segments of a speech signal are ambiguous, and we need to take into account context in order to make sense of an utterance. Probability theory provides a rigorous method for representing and reasoning with uncertain knowledge. The course covers two main areas (i) the process of inference in probabilistic reasoning systems and (ii) learning probabilistic models from data. Its aim is to provide a firm grounding in probabilistic modelling and reasoning, and to give a basis which will allow students to go on to develop their interests in more specific areas, such as data-intensive linguistics, automatic speech recognition, probabilistic expert systems, statistical theories of vision etc.\n\n\n\nThis 20 credit course replaces INFR11050 Probabilistic Modelling and Reasoning - 10 credit version.", "Description": "The course will cover the most important topics in probabilistic modelling and unsupervised learning, and provide a thorough basis for understanding other extensions developments and applications.\n\n\n\n*Introduction \n\n\n\n* Probability \n\n - events, discrete variables \n\n -  joint, conditional probability \n\n\n\n* Discrete belief networks, inference \n\n\n\n* Continuous distributions, graphical Gaussian models \n\n\n\n* Learning: Maximum Likelihood parameter estimation \n\n\n\n* Decision theory \n\n\n\n* Hidden variable models \n\n - mixture models and the EM algorithm \n\n - factor analysis\n\n - ICA, non-linear factor analysis\n\n \n\n* Dynamic hidden variable models \n\n - Hidden Markov models\n\n - Kalman filters (and extensions) \n\n\n\n* Undirected graphical models \n\n - Markov Random Fields \n\n - Boltzmann machines \n\n\n\n* Information theory \n\n - entropy, mutual information \n\n - source coding, Kullback-Leibler divergence \n\n\n\n* Approximate Inference: MCMC, Variational Methods\n\n\n\n* Bayesian methods for \n\n - Inference on parameters \n\n - Model comparison"},
{"courseName": "Principles and Design of IoT Systems", "EUCLID Code": "INFR11150", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11150.htm", "Acronym": "PDIoT", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "20", "Year": "4", "Delivery": "S1", "Exam Diet": "April/May", "Work%/Exam%": "70/30", "Lecturer(s)/Coordinator(s)": "D K Arvind", "Summary": "The course 'Principles and Design of the Internet of Things Systems' (PDIoT) is concerned with the emerging discipline of digitising the physical world with wireless sensors,  analysing the sensor data to provide actionable information, and influencing the physical world via actuators, with an optional  human in the loop.  The course imparts foundational  concepts in IoT in a series of 10 lectures and students gain hands-on experience by realising their application idea as a demonstratable IoT system prototype.   The lectures will be illustrated with a number of IoT case studies undertaken by the lecturer over the past fifteen years.", "Description": "The course aims to deliver a sound understanding of the design and analysis of Internet of Things through lectures and practice. The lectures provide the foundational knowledge in sensors and actuators, fusion of data from multiple sensors, sensor data calibration and topics in sensor data analytics: pre-processing and extraction of features in time-series sensor data, and classification methods using a selection of machine learning techniques. The students conduct a major piece of coursework working in pairs to develop an application using an IoT platform together with a mobile application. Students will experience all the stages in the design and implementation of a complex system - from its specification to the demonstration of a working prototype. They will be exposed to aspects of embedded systems programming, sensor data analytics using machine learning, data collection, algorithm  development, user interface design, mobile application design, system integration and testing. The goal is to develop a step counter which should detect walking on level ground and climbing stairs. Each student pair will be given an NRF52DK dev board with Bluetooth wireless connection, and triaxial accelerometer and gyroscope sensors. On-device firmware will be developed using the mbed platform and Android will be used for an accompanying mobile application. Each pair will demonstrate a working prototype at the end of 10 weeks and deliver a written report by the end of  Week 1 in the second semester."},
{"courseName": "Practical Introduction to High Performance Computing (Distance Learning)", "EUCLID Code": "INFR11184", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11184.htm", "Acronym": "EPCC/15", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "High Performance Computing (HPC) is a fundamental technology used in solving scientific and commercial problems. Many of the grand challenges of science depend on simulations and models run on HPC facilities to make progress, for example: protein folding, the search for the Higgs boson and developing nuclear fusion. In industry, sophisticated computer models are integral to the development of products such as jet engines, wind turbines and new drugs.\n\n\n\nModern supercomputers are parallel computers, gaining their power from many thousands of individual processors. Developing software to run on these systems requires using new parallel programming techniques.\n\n\n\nThe course will cover all the fundamental concepts that underpin modern HPC. The course is practical in the sense that you will explore these topics by running parallel programs on real HPC systems such as the UK national supercomputer ARCHER.\n\n\n\nThe course will be delivered entirely online, and videos, notes and exercises will be released as the course progresses.\n\n\n\nN.B. This has a non-standard duration (20 weeks) which will be incompatible with many programmes.", "Description": "Modern supercomputers are parallel computers, gaining their power from many thousands of individual processors. Developing software to run on these systems requires using new parallel programming technologies. The course will cover all the fundamental concepts that underpin modern HPC. The course is practical in the sense that you will explore these topic by running parallel programs on real HPC systems such as the UK national supercomputer ARCHER. The same techniques can also be applied to smaller systems such as multi-core desktops, graphics processors and computing clusters. \n\n\n\nThe course has three main themes:\n\n\n\n1) Hardware, Architectures, System Software\n\nHow are HPC systems constructed and what impact do components play in performance of applications? What system software is used on HPC systems and how does it impact the user experience?\n\n\n\n2) Parallel Programming\n\nWhat are the key parallel programming paradigms in use on modern HPC systems and how are they implemented and made available to users in practice? How do you measure parallel performance and scaling? How do you debug and profile parallel applications?\n\n\n\n3) Applications on HPC systems\n\nWhat types of applications run on modern HPC systems and what are the limiting factors to scaling and performance in these areas? What does the future hold for HPC applications - how will they run on next generation HPC systems."},
{"courseName": "Practical Introduction to Data Science (Distance Learning)", "EUCLID Code": "INFR11183", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11183.htm", "Acronym": "EPCC/14", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "This course is ONLY available to students on the online DSTI programmes (please see below* for alternatives).\n\n\n\nThis online course will provide a practical introduction to data science. It will have two broad themes, namely Data Management and Data Analytics.\n\n\n\nData Science is an emerging field, which is becoming very important both in research, business and industry. The amount of data that is being generated and stored is greater than it has ever been, and this brings both challenges in terms of how you work with the data and - importantly - rewards in terms of new insight gained from analysing the data.\n\n\n\nThe course is practical in the sense that you will have the chance to use R and Python to explore the techniques and ideas described in the course videos.\n\n\n\nThe course will be delivered entirely online, and videos, notes and exercises will be released as the course progresses.", "Description": "Data Science means different things to different people. In this course, we interpret the term fairly broadly, and look at the various aspects of the process of extracting knowledge from data. This course is intended to give a broad introduction to the topic but it will get into sufficient detail to provide practical, hands-on experience of some of the tools and techniques used widely in academic research and in commercial environments.\n\n\n\nData Science is a very interdisciplinary field and so the course will expose students to aspects of computer science, software engineering, maths and statistics. It is designed to be accessible whether you come from one of these backgrounds, or whether you come from an applications area (be that in business, science, or elsewhere). \n\n\n\nThe course will have two main (intertwined) strands that will cover \"looking after data\" so that it can be used for analysis and the actual processing of this data to provide insight and answers to specific questions.\n\n\n\nThe course will cover:\n\n- Why managing data better matters, and why it's hard\n\n- Data formats: structuring data and keeping them useful Metadata: describing data and keeping them useful Research data management planning \n\n- Publication and citation of research data\n\n- Persistence, preservation and provenance of research data \n\n- Licensing, copyright and access rights: some things researchers need to know \n\n- Key data analytical techniques such as, classification, optimisation, and unsupervised learning \n\n- Key parallel patterns, such as Map Reduce, for implementing analytical techniques \n\n- Practical introductions to key Data Science tools and their application to data science problems, e.g., R, Python \n\n- Case studies from academia and business"},
{"courseName": "Randomness and Computation", "EUCLID Code": "INFR11089", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11089.htm", "Acronym": "RC", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Mary Cryan", "Summary": "This course is about probabilistic methods and their application to computer science. The course introduces basic models and techniques and applies these techniques to the design of various randomized algorithms, data structures, and distributed protocols. Special emphasis will be given on applications of these ideas to other areas of computer science (e.g. networking, machine learning, etc).", "Description": "- Introduction: Las Vegas and Monte Carlo algorithms\n\n  (Elementary Examples: checking identities, fingerprinting)\n\n\n\n- Moments, Deviations and Tail Inequalities \n\n  (Balls and Bins, Coupon Collecting, stable marriage, routing)\n\n\n\n- Randomization in Sequential Computation\n\n  (Data Structures, Graph Algorithms)\n\n\n\n* Randomization in Parallel and Distributed Computation\n\n  (algebraic techniques, matching, sorting, independent sets)\n\n\n\n* Randomization in Online Computation \n\n  (online model, adversary models, paging, k-server)\n\n   \n\n- The Probabilistic Method\n\n  (threshold phenomena in random graphs, Lovasz Local Lemma)\n\n\n\n- Random Walks and Markov Chains\n\n  (hitting and cover times, Markov chain Monte Carlo)"},
{"courseName": "Project Preparation", "EUCLID Code": "INFR11173", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11173.htm", "Acronym": "EPCC/17", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "YR", "Exam Diet": null, "Work%/Exam%": "90/10", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "This course comprises all aspects of the planning for the individual research project and is undertaken by the student in conjunction with the project supervisor(s). The student and supervisor(s) will agree the topic of the project, after which the student will conduct initial reading to refine the scope of the project and to inform the development of a detailed plan for its implementation. The student will deliver awritten report and make an oral presentation that both describe the background to the project and outline the plan for its successful completion.", "Description": "This course encompasses the selection and preparation phase for a dissertation project in High Performance Computing or High Performance Computing with Data Science. The precise topics covered will vary depending on the individual project selected.\n\n\n\nTopics covered:\n\n- Report writing\n\n- Academic misconduct and how to avoid it\n\n- Professional Skills"},
{"courseName": "Programming Skills", "EUCLID Code": "INFR11177", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11177.htm", "Acronym": "EPCC/16", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "This course is designed to help you to produce higher quality code; code that is readable, maintainable, usable, correct and efficient in less time and with less effort. These programming skills are applicable to programs in any language and the course is illustrated with examples from C, Python, Fortran 90, and Java.\n\n\n\nAreas of specific relevance to parallel high-performance computing, including the use of batch systems, scientific libraries, profilers, and performance analysis, are also covered.", "Description": "The course covers the following:\n\n- Best practices for scientific computing.\n\n- Introduction to operating systems, compilers and batch systems.\n\n- Writing programs for people, programs that are readable, maintainable, and usable.\n\n- Reviewing code to identify bugs and share expertise.\n\n- Debugging using code browsers and debuggers.\n\n- Managing versions and collaborating using revision control.\n\n- Automating common tasks and building programs using a build tool.\n\n- Automated regression and unit testing to help ensure and maintain program correctness.\n\n- Profiling and performance analysis to identify and improve a program's use of processing and memory resources.\n\n- Security, authentication and authorisation concepts.\n\n- REST application programming interfaces.\n\n- Open source software."},
{"courseName": "Professional Issues", "EUCLID Code": "INFR10022", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10022.htm", "Acronym": "PI", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "10", "Points": "10", "Year": "3", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Stuart Anderson", "Summary": "There are many commercial, engineering and professional issues, complementary to the necessary scientific knowledge and technical skills, that impinge on the work of the computing professional. The Professional Issues course aims to provide a general awareness of these issues and to cover some of them in depth. The course will involve lectures from members of staff and visitors and directed reading.", "Description": "* Personal Attributes: study skills, personal development, interpersonal skills; employers' views and expectations of graduates; study skills, writing skills, presentation skills.\n\n* The Computing Profession: professional bodies; codes of conduct and practice.\n\n* Social and ethical issues: security, privacy, software ownership\n\n* Legal Issues: legal and regulatory frameworks; software contracts and liability; intellectual property, copyright and patents; computer misuse, data protection; health and safety.\n\n* Commercial Issues: organisational structures; finance, accounting, audit; resource management.\n\n* Computing Projects: design, prototype and product; product development cycle; marketing and market research; project management and team working; change management. \n\n* This course consolidates complements and assesses the students appreciation and understanding of Professional Issues introduced across our curriculum.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Professionalism"},
{"courseName": "Secure Programming", "EUCLID Code": "INFR11098", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11098.htm", "Acronym": "SP", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "David Aspinall", "Summary": "This course studies the principles and practices of secure programming. Secure programming means writing programs in a safe fashion, to avoid vulnerabilities that can be exploited by attackers. It also means using security features provided by libraries, such as authentication and encryption, appropriately and effectively. A range of programming platforms will be considered, ranging from low-level (e.g. Android OS), through web programming (e.g., JavaScript and Python) to high-level large-scale languages (e.g., Java). New and emerging language-based security mechanisms will be examined, including ways of specifying and enforcing security policies statically and dynamically (e.g., to enforce access controls or information flow policies).", "Description": "- Security maintainance of deployed software systems, including \"penetrate-and-patch\", vulnerability enumeration (CVE IDs) and classification (CWE taxonomy).\n\n- Secure programming techniques and common pitfalls, covering input validation, output filtering, use of cryptography and authentication. Standards such as the OWASP guidelines and the CERT Secure Coding Standards.\n\n- Malware (including adware, spyware) and its use of software vulnerabilities as an attack vector. Programming resilience against malware.\n\n- Low-level programming platforms, VMs and their security provisions, for example including process isolation, capabilities and permissions. Mobile operating system platforms as examples.\n\n- Web programming platforms and security provisions. HTTP protocol, forms, clientside and server-side threats and their avoidance.\n\n- High-level and Enterprise security programming, including cryptography via cryptographic libraries, authentication via GSSAPI.\n\n- Security APIs and their distinction from cryptography APIs. Use and design of security APIs for key management, hashing and encryption. Implementation in hardware and software.\n\n- Language-based techniques for assisting security programming, using dynamic enforcement via runtime monitoring and static enforcement via program analysis. Example tools.\n\n- Methods and tools for taint checking and information flow tracking to manage programming with sensitive data. Privacy risks with lack of encapsulation.\n\n- Methods and tools for controlling resource usage with permissions and capabilities, and static analysis for guarantees in advance."},
{"courseName": "Robotics: Science and Systems", "EUCLID Code": "INFR11092", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11092.htm", "Acronym": "RSS", "AI": "AI", "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "50/50", "Lecturer(s)/Coordinator(s)": "Zhibin Li", "Summary": "This course will be a Masters degree level introduction to several core areas in robotics: kinematics, dynamics and control; motion planning; state estimation and signal processing, localization and mapping. Lectures on these topics will be complemented by a large practical that exercises knowledge of a cross section of these techniques in the construction of an integrated robot in the lab, motivated by a task such as robot navigation. Also, in addition to lectures on algorithms and lab sessions, we expect that there will be several lecture hours dedicated to discussion of implementation issues - how to go from the equations to code.\n\n\n\nThe aim of the course is to present a unified view of the field, culminating in a practical involving the development of an integrated robotic system that actually embodies key elements of the major algorithmic techniques.", "Description": "The tentative coverage of topics is as follows:\n\n- Kinematics - forward and inverse\n\n- Dynamics\n\n- Control - classical and modern control theories\n\n- Sensing - proprioception, etc.\n\n- Motion planning - basics and sampling based methods\n\n- State estimation, localization and mapping\n\n- Implementing SLAM; Multi-modal sensor fusion"},
{"courseName": "Robotics and Autonomous Systems Research Thesis", "EUCLID Code": "INFR11118", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11118.htm", "Acronym": "RASRT", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "100", "Year": "5", "Delivery": "B5+", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Michael Herrmann", "Summary": "Under the guidance of the supervisor, the student conducts a program of independent research in an area of Robotics and Autonomous Systems, and writes an extended dissertation on the topic. The dissertation must demonstrate a critical survey of knowledge in the field, a capability for pursuing research and a satisfactory plan for a more advanced research project, presented in a critical and scholarly way.", "Description": "Project Dependent"},
{"courseName": "Robot Learning and Sensorimotor Control", "EUCLID Code": "INFR11186", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11186.htm", "Acronym": "RLSC", "AI": "AI", "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Michael Mistry", "Summary": "This course is designed as a follow up to the introductory course on Robotics: Science and Systems and will gear students towards advanced topics in robot control, learning and planning from an optimisation perspective. Control of complex, compliant, multi degree of freedom (DOF) sensorimotor systems like humanoid robots or autonomous vehicles have been pushing the limits of traditional planning and control methods.\n\nThis course aims at introducing an optimisation approach to the challenges and will take the students through various aspects involved in motor planning, control, estimation, prediction and learning with an emphasis on the computational perspective. We will learn about optimisation and learning tools and methodologies particularly geared towards problems of online real-time predictive planning for robot control.\n\nIssues and possible approaches for planning under uncertainty and redundancy, sensorimotor transformations and stochastic optimal control will be discussed. This will be put in context through exposure to topics in underactuated systems, legged locomotion and human motor control, and the use of computational methods in understanding biological sensorimotor mechanisms.", "Description": "Syllabus Information:\n\n\n\n1. Optimal Control Approaches - Dynamic Programming, LQR, Trajectory Optimization: Direct and Shooting Methods (iLQR, DDP)\n\n2. Adaptive Learning and Control - Predictive Control - Underactuation - Multi-contact modelling and optimization - Constrained Operational Space Control - Hierarchical QP and Stack of task formulation\n\n3. Interaction and Robust Control - Stochastic Optimal Control - LQG - Cartesian Impedance Control - Passivity Methods - Lyapunov Stability - LQR-Trees and Sum-of-Squares Programming\n\n4. Movement Primitives - Rhythmic vs Point to Point Movements - Dynamical Systems and DMPs - Path Integral Methods - Learning by Demonstration\n\n5. Understanding Human Sensorimotor Control - Force Field and Adaptation - Optimal control theory for Explaining Sensorimotor Behaviour - Impedance Control - Human(oid) Locomotion and Stability."},
{"courseName": "Threaded Programming", "EUCLID Code": "INFR11178", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11178.htm", "Acronym": "EPCC/19", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "This course is a practical introduction to parallel programming using the threading model, which is commonly used on shared memory and multicore hardware. The majority of the course is focused on teaching the use of the industry standard OpenMP API.", "Description": "After taking this course students should have a good practical understanding of multithreaded programming and be competent OpenMP programmers.\n\n\n\nThe course will cover the following topics:\n\n- Basic concepts of shared memory: threads, tasks, shared/private data, synchronisation.\n\n- Concepts of OpenMP: parallel regions, shared/private variables, parallel loops, reductions\n\n- OpenMP parallel regions and associated clauses\n\n- OpenMP worksharing directives, scheduling of parallel loops\n\n- OpenMP synchronisation: barriers, critical sections, atomics, locks.\n\n- OpenMP tasks\n\n- Additional features of OpenMP: nesting, orphaning, threadprivate globals, OpenMP 4.0 features\n\n- OpenMP implementations\n\n- Memory models.\n\n\n\nLectures will be followed by tutored practical sessions illustrating the key concepts. Students will have the choice of using either C or Fortran in the practical programming sessions on OpenMP."},
{"courseName": "The Human Factor: Working with Users", "EUCLID Code": "INFR11141", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11141.htm", "Acronym": "THF", "AI": "AI", "CG": "CG", "CS": "CS", "SE": "SE", "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Benjamin Bach", "Summary": "This is an introduction to the fields of Human Factors and User Experience with an emphasis on developing practical skills that are grounded in a strong knowledge of theory.", "Description": "\"If the user can't use it, then it doesn't work at all.\" (Susan Dray) When technical systems that have been crafted in years of painstaking work fail in practice, more often than not this is due to a lack of fit between the complex system, the people who interact with it, and the contexts in which it is used. In the best case, failure is just annoying, in the worst case, it costs lives.\n\nIn this course, we will look at the art and craft of building technical systems that people can actually use successfully. To this end, we will draw on relevant findings from anthropology; behavioural, cognitive and social psychology; human-computer interaction; and sociology. The course will be taught using a flipped classroom - before class, you will work through materials; in class, we will work on activities designed to review the material and deepen your learning."},
{"courseName": "Text Technologies for Data Science", "EUCLID Code": "INFR11145", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11145.htm", "Acronym": "TTDS", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "11", "Points": "20", "Year": "4", "Delivery": "YR", "Exam Diet": "April/May", "Work%/Exam%": "50/50", "Lecturer(s)/Coordinator(s)": "Walid Magdy", "Summary": "This course teaches the basic technologies required for text processing, focussing mainly on information retrieval and text classification. It gives a detailed overview of information retrieval and describes how search engines work. It also covers basic knowledge of the main steps for text classification. \n\n\n\nThis course is a highly practical course, where at least 50% of what is taught in the course will be implemented from scratch in course works and labs, and students are required to complete a final project in small groups. All lectures, labs, and two course works will take place in Semester 1. The final group project will be due early Semester 2 by week 3 or 4.", "Description": "Syllabus:\n\n* Introduction to IR and text processing, system components\n\n* Zipf, Heaps, and other text laws \n\n* Pre-processing: tokenization, normalisation, stemming, stopping.\n\n* Indexing: inverted index, boolean and proximity search\n\n* Evaluation methods and measures (e.g., precision, recall, MAP, significance testing).\n\n* Query expansion\n\n* IR toolkits and applications\n\n* Ranked retrieval and learning to rank\n\n* Text classification: feature extraction, baselines, evaluation\n\n* Web search"},
{"courseName": "System Design Project", "EUCLID Code": "INFR09032", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09032.htm", "Acronym": "SDP", "AI": "AI", "CG": null, "CS": "CS", "SE": "SE", "Level": "9", "Points": "20", "Year": "3", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Barbara Webb", "Summary": "The System Design Project is intended to give students practical experience of (a) building a large scale system (b) working as members of a team. The project involves applying and combining material from several courses to complete a complex design and implementation task. At the end of course each group demonstrates its implemented system and gives a formal presentation to an audience of the students, supervisors, and visitors from industry.", "Description": "During this project students work in groups of about ten on the design and implementation of a complete system to solve some practical and useful problem. All groups perform the same task. This primarily involves software implementation but may potentially also involve hardware design and construction where this is relevant. Recent examples of projects include: an automated on-line supermarket; building webcam-based home and commercial security systems; constructing Mars and Lunar rovers controlled from an Earth-based web browser interface, etc.\n\n\n\nEach group is provided with the same facilities. These include one or more PCs dedicated to them and other equipment depending on the particular project, for instance a webcam, a Lego robot construction kit, hardware prototyping kit, diagnostic equipment etc. They also have a small amount of money to spend in any way they choose on any extra items they feel might enhance their particular design. Project management software is also available to them.\n\n\n\nEach group is assigned a mentor. The mentor's task is to advise and provide feedback on the progress of the group during the project but not to provide technical support. Consultants from amongst the academic and support staff are made available to advise on aspects of the task such as management, specific pieces of software and hardware etc. Groups meet with their mentors at least once a week. They also meet amongst themselves more frequently to plan and coordinate their activities.\n\n\n\nTowards the end of the semester, a day is set aside for groups to demonstrate their implemented system and to give a formal presentation of it to an audience of the students, mentors, and visitors from industry.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Computer Based Systems, Systems Analysis and Design"},
{"courseName": "Usable Security and Privacy", "EUCLID Code": "INFR11158", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11158.htm", "Acronym": "USec", "AI": "AI", "CG": "CG", "CS": "CS", "SE": "SE", "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Kami Vaniea", "Summary": "Humans are a vital component of secure and private systems, they are also one of the most expensive components and the most challenging to reason about. In this course, students will learn about how to create systems that are usable while still fulfilling their primary security or privacy mission. Students will also learn about research topics such as designing user studies to critically evaluate interfaces and reading academic papers to create an academically-informed view of the topic.", "Description": "- Introduction: History and overview of the Usable Security and Privacy research area including the transition from blaming users to treating them as valued components of a secure system.\n\n- Study design: Security and privacy activities tend to be secondary tasks. The student will learn how to design and analyze usability studies that are common in security and privacy such as targeting secondary tasks or using some deception.\n\n- Privacy: Basic overview of the definitions of privacy as well as some of the legal and social aspects of it. Analysis of common privacy issues and how they are expressed through user interaction with systems.\n\n- Security: Overview of common security technologies and how they are impacted by usability. In- depth look at select topics such as password construction and management.\n\n- Ethics: Discussion of ethics, particularly around research in topics in security and privacy where participants can be particularly vulnerable."},
{"courseName": "Types and Semantics for Programming Languages", "EUCLID Code": "INFR11114", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11114.htm", "Acronym": "TSPL", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Philip Wadler", "Summary": "Type systems and semantics are mathematical tools for precisely describing aspects of programming language. A type system imposes constraints on legal programs in order to guarantee their safe execution, whilst a semantics specifies what a program will do when executed. This course gives an introduction to the main ideas and methods of type systems and semantics. This enables a deeper understanding of existing programming languages, as well as the ability to design and specify new language features.\n\n\n\n**PLEASE NOTE - THIS COURSE HAS REPLACED Types and Semantics for Programming Languages (INFR10040)**", "Description": "*Inductive definitions and proof by induction\n\n*Untyped and simply-typed lambda calculus. Variable binding.\n\n*Small step and big step semantics.\n\n*Progress and preservation theorems.\n\n*Products, sums, and list types.\n\n*Reference types and exceptions.\n\n*Subtyping. Subsumption and its understanding as inclusion or coercion.\n\n*Principles of operational semantics.\n\n*Key concepts of semantics: compositionality, adequacy, observational equivalence, full abstraction, and definability.\n\n\n\nRelevant QAA Computing Curriculum Sections: Comparative Programming Languages, Compilers and Syntax Directed Tools, Programming Fundamentals, Theoretical Computing"},
{"courseName": "Software Testing", "EUCLID Code": "INFR10057", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10057.htm", "Acronym": "ST", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "10", "Points": "10", "Year": "3", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Ajitha Rajan", "Summary": "This module is intended to provide in-depth coverage of software testing further to develop the introductory material covered in Informatics 2C - Software Engineering. The goal of the course is to provide students with the skill to select and apply a testing strategy and testing techniques that are appropriate to a particular software system or component. In addition the student will become a capable user of test tools; will be able to assess the effectiveness of their testing activity; and will be able provide evidence to justify their evaluation. The course will be supported by two practical exercises involving the development of appropriate tests and the application of a range of testing tools. This course is based on the IEEE Software Engineering 2004 Software Testing syllabus.", "Description": "# Testing techniques and principles: Defects vs. failures, equivalence classes, boundary testing.\n\n# Types of defects.\n\n# Black-box vs. Structural testing.\n\n# Testing strategies: Unit testing, integration testing, profiling, test driven development.\n\n# State based testing; configuration testing; compatibility testing; web site testing.\n\n# Alpha, beta, and acceptance testing.\n\n# Coverage criteria.\n\n# Test instrumentation and tools.\n\n# Developing test plans.\n\n# Managing the testing process.\n\n# Problem reporting, tracking, and analysis.\n\n\n\nRelevant QAA Computing Curriculum Sections: Software Engineering"},
{"courseName": "Software Development", "EUCLID Code": "INFR11172", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11172.htm", "Acronym": "EPCC/18", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "Software development is more than just writing programs and this course provides an introduction to the complete range of software development activities, from gathering requirements through to evaluation of a finished product. The course describes how software development projects are created and managed to achieve the delivery of high-quality, efficient, robust, portable, usable software products. You will be introduced to areas of increasing prominence in both academia and industry including the importance of software sustainability and the rise of agile methods and extreme programming. The course should support in the understanding of the value of practical software development skills to the HPC, computational science and engineering.", "Description": "Course Topics:\n\n- Software Development Projects and Processes\n\n- Development Models\n\n- Project Approaches including Agile and PRINCE2\n\n- Project Planning: Task Scheduling and Risks\n\n- Design: Requirements Capture and Prioritisation, Interfaces, Code, System\n\n- Software Testing \n\n- Usability and Evaluation \n\n- Project Teams and Communications\n\n- Project Reviews"},
{"courseName": "Software Architecture, Process, and Management", "EUCLID Code": "INFR11038", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11038.htm", "Acronym": "SAPM", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Stuart Anderson", "Summary": "Large-scale systems differ from small-scale system in the challenges they pose in capturing, and\n\nmanaging the process of delivering systems that conform to, quality attribute requirements (e.g.\n\navailability, performance, security). Software Architecture provides a framework for managing\n\nthese aspects of systems. This course introduces Software Architecture concepts and provides\n\nexperience of the use of Software Architecture in the development process and management of\n\nsystems.", "Description": "Software Architecture: Quality Attributes; Large-scale systems; Quality Attribute Scenarios;\n\nArchitectural Tactics; Design Checklists; Tradeoffs; Architectural Patterns; Product Lines; Exemplar\n\nQuality Attributes (Availability; Performance; Security; Testability; Usability; ¿); Case Studies\n\n(Apache, Linux, Real-time Architecture, Medical Systems, Banking Systems, ¿).\n\n\n\nSoftware Architecture in the Development Process: Architecture in Processes (Traditional ¿ Vmodel,\n\nRisk-centric, Agile), Process Improvement, Modern Developments (e.g. DevOps).\n\n\n\nManagement Aspects: Tools through the process; planning; tracking; cost management; people and teams.\n\n\n\nRelevant QAA Computing Curriculum Sections: Professionalism, Software Engineering, Systems\n\nAnalysis and Design"},
{"courseName": "Social and Technological Networks", "EUCLID Code": "INFR11124", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11124.htm", "Acronym": "STN", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "VUG: December; April/May", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Rik Sarkar", "Summary": "In this course, we will study core properties of networks arising in various social, scientific and technological contexts. We will see techniques for their analysis, and applications in social networks, World Wide Web, Internet, IoT etc. The course will cover fundamental theories and techniques from machine learning, algorithms and mathematics. We will see the relevance of these techniques in real networks, as well as use of network-based techniques in more general data analysis. The course will involve theoretical analysis in class, development of algorithms, and writing of programs to analyse network data.", "Description": "The course will study computational, mathematical and data analysis aspects of networks. Typical topics will include properties of social networks, epidemics, spread of innovation, random graphs, metric properties, preferential attachments and power law networks. It will cover relation to data analysis and machine learning: including clustering and community detection, submodularity, optimization, embedding (dimension reduction) and classification. Other current topics will be covered as appropriate."},
{"courseName": "Reinforcement Learning", "EUCLID Code": "INFR11010", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11010.htm", "Acronym": "RL", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Stefano Albrecht", "Summary": "Reinforcement learning (RL) refers to a collection of machine learning techniques which solve sequential decision making problems using a process of trial-and-error. It is a core area of research in artificial intelligence and machine learning, and today provides one of the most powerful approaches to solving decision problems. This course covers foundational models and algorithms used in RL, as well as advanced topics such as scalable function approximation using neural network representations and concurrent interactive learning of multiple RL agents.", "Description": "Main topics to be covered include the following (see course website for more details):\n\n\n\n* Reinforcement learning framework\n\n* Bandit problems and action selection\n\n* Dynamic programming\n\n* Monte Carlo methods\n\n* Temporal difference learning\n\n* Planning in RL\n\n* Temporal abstraction\n\n* Function approximation for generalisation\n\n* Actor-critic and gradient-based optimisation\n\n* Multi-agent reinforcement learning\n\n* Environments with partial observability\n\n* Training agents and evaluating performance\n\n\n\n\n\nRelevant QAA Computing Curriculum Sections:  Artificial Intelligence, Data Structures and Algorithms, Intelligent Information Systems Technologies, Simulation and Modelling"},
{"courseName": "Pervasive Parallelism", "EUCLID Code": "INFR11108", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11108.htm", "Acronym": "PERP", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Murray Cole", "Summary": "In this course students develop their six page MSc(R) project proposal, while engaging in a sequence of collaborative activities designed to broaden their awareness of the Pervasive Parallelism landscape, developing research critiquing and presentation skills, and building research relationships with other members of the CDT cohort. In the first phase, students will be paired and, working together, will review current research in both their own and their partner's research area. Partners will be allocated to span diverse areas. Pairs will present their findings and critique the reviewed work to the larger group of CDT students, with each student focusing on presentation of the partners material. In the second phase, students will be paired with a new partner. Each student will develop an individual six page document constituting the proposal for their emerging MSc(R) thesis. Once again, they will collaborate during this phase on presentation of the proposal with a fellow student, with each student ultimately giving the other's presentation to the group. Students will develop generic research skills that can be deployed in academic or industrial environments. Students will demonstrate their ability to develop interesting concepts and hypotheses into research proposals. The course is ultimately assessed on the content of the student's own individual research proposal.", "Description": "Not entered"},
{"courseName": "Performance Programming", "EUCLID Code": "INFR11167", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11167.htm", "Acronym": "EPCC/13", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "Application performance is one of the key requirements for HPC applications. However this is one of the more difficult requirements to satisfy:\n\n\n\n- Issues effecting performance often vary between different hardware and software environments. This requires performance issues to be frequently re-visited as the hardware and software environment changes.\n\n- Performance programming requires detailed knowledge of the underlying environment\n\n- The design decisions necessary to achieve good performance are often in conflict with other desirable properties of the program.\n\n\n\nAfter taking this course students should have a good practical understanding of the general issues and methodologies associated with designing building and refactoring codes to meet performance requirements. In addition they will have an overview of a number of subjects that are important in the understanding of performance on current systems.", "Description": "The course will cover the following topics:\n\n- Overview of performance programming. Methodology, the optimisation cycle.\n\n- Designing for performance. Encapsulation as an aid to performance tuning.\n\n- Tools for performance programming. Profilers and code instrumentation.\n\n- Compilers and compiler optimisation.\n\n- Memory hierarchies, Memory structures and associated optimisations.\n\n- Performance tuning for shared memory.\n\n- Floating point performance. Pipelines, SIMD, vectorisation."},
{"courseName": "Performance Modelling (Level 11)", "EUCLID Code": "INFR11082", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11082.htm", "Acronym": "PM", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Jane Hillston", "Summary": "This course teaches various aspects of computer-aided modelling for performance evaluation of (stochastic) dynamic systems. The main focus is on stochastic modelling of computer systems and communication networks to assess performance characteristics such as throughput, response time etc.; however other dynamic systems such as manufacturing systems may also be considered. The central concept of the course will be that a model is as an abstract representation of a system which can be used as a tool to derive information about dynamic behaviour of the system. The more detail we invest in the model, the more sophisticated the information we can extract from it. As the course progresses the model will become increasingly detailed; the corresponding solution techniques will similarly become more complex, relying on increasing levels of computer assistance.", "Description": "*Modelling and performance evaluation: models as tools; equilibrium and transient behaviour; analytic vs. algorithmic models. Revision of basic probability concepts.\n\n*Making use of models: deriving performance measures from an equilibrium distribution; choosing the parameters for a model; measurement and workload modelling; experimentation.\n\n*Representing systems directly as analytic models: operational laws such as Little's Law, simple queues and Markov processes; solving equations to find equilibrium behaviour.\n\n* Representing systems as algorithmic models: process-oriented and event-oriented simulation, variance reduction and stopping conditions.\n\n*High-level modelling languages: the stochastic process algebra PEPA, stochastic Petri nets and networks of queues.\n\n\n\n\n\nRelevant QAA Computing Curriculum Sections:  Simulation and Modelling"},
{"courseName": "Parallel Programming Languages and Systems", "EUCLID Code": "INFR11023", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11023.htm", "Acronym": "PPLS", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Murray Cole", "Summary": "The module familiarises students with the issues involved in designing, implementing and applying parallel programming systems. Initial motivation will be provided by consideration of a number of typical high performance applications and parallel architectures. This will highlight the role of parallel software systems as a means of bridging the gap between these and allow abstraction of the issues which must be addressed by any such system (partitioning, communication, agglomeration, scheduling). It will explore the ways in which these challenges have been addressed by a range of systems, including both de facto standards and more adventurous research projects.", "Description": "* Introduction. Conceptual and architectural models of parallelism. Parallel algorithmic paradigms and simple parallel algorithms.Iterative, recursive pipeline and bag-of-task parallelism.\n\n* Generic issues in shared variable programming. Mutual exclusion, condition synchronization. Locks, barriers semaphores and monitors, use and implementation.\n\n* Realisation in Pthreads and Java.\n\n* Issues in message passing programming. Channels and synchronization models.\n\n* Realisation in MPI: communicators, simple and collective operations\n\n* Selected case studies highlighting alternative approaches, for example,\n\no Associative models. Linda, tuple space and related primitives.\n\no Threading Building Blocks.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Concurrency and Parallelism"},
{"courseName": "Software Design and Modelling", "EUCLID Code": "INFR10064", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10064.htm", "Acronym": "SDM", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "10", "Points": "20", "Year": "3", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "50/50", "Lecturer(s)/Coordinator(s)": "Perdita Stevens", "Summary": "This course introduces the design and modelling of software systems using object-oriented techniques. We start by exploring the use of modelling in software development. Students learn to document designs in the Unified Modeling Language, UML, with emphasis on class, sequence and state diagrams and the Object Constraint Language, OCL. We use modern model-driven development tools and discuss their strengths and weaknesses. We study criteria that make one design better than another in context and introduce design principles and patterns that capture good practice.\n\n\n\nThis course replaces INFR10056 - Software Engineering with Objects and Components.", "Description": "The course begins by placing design and modelling in the context of the various software engineering processes in widespread use today. Via labs, lectures and self-study using readings, videos and formative exercises, it teaches students to produce (initially straightforward) designs and to document them using UML models, both on paper and with an appropriate tool. We discuss the different affordances of these modes and how models may be used (i) purely informally, (ii) as reviewed documentation for designs, and/or (iii) in model-driven development in which models are formal artefacts and code may be generated from them.\n\n\n\nThe second part of the course focuses on identifying and producing good designs. What principles should a good object-oriented design follow? We learn some common design patterns and their role in development and learning.\n\n \n\nFinally we turn to practical model-driven development: how can the cost-benefit ratio of modelling be improved, now and potentially in the future? Students will learn about model transformations, both model-to-model and model-to-text (e.g., code generation) and be introduced to current tools supporting these. We discuss the role of domain specific languages and the integration of model driven development with agile processes. Throughout the course, we identify the deficiencies as well as the benefits of the fast-changing state of the art, aiming to equip students to critically evaluate tools and techniques that become available to them in future."},
{"courseName": "Parallel Design Patterns", "EUCLID Code": "INFR11168", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11168.htm", "Acronym": "EPCC/12", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "If you were given a serial problem, conceptually, how would you go about splitting it up into many different parts that could run concurrently on the latest supercomputers?\n\n\n\nThe good news is that we don't need to reinvent the wheel. Instead there are many different approaches (called parallel patterns) that have been developed by the community and can be used in a variety of situations. These patterns apply equally well regardless of whether our problem is a computational one or data driven.\n\n\n\nUnderstanding and being able to apply these patterns also helps getting to grips with existing parallel codes and optimising poorly performing computation and data codes. Whilst the lectures take a top down approach, focusing on the patterns themselves, the practical tutorials give students the opportunity to explore the concepts by implementing pattern based solutions to problems using common HPC technologies.", "Description": "Reusability is a key driver of this module, both reusability of knowledge (the patterns themselves) and parallel codes (via frameworks.) The parallel patterns (known as a pattern language) that we cover are split into two categories. This closest to the problem area (and most abstract) are parallel algorithm strategy patterns and include:\n\n- Task Parallelism\n\n- Recursive Splitting\n\n- Geometric Decomposition\n\n- Pipeline\n\n- Discrete Event\n\n- Actors\n\n\n\nThe other category of patterns is closer to the implementation and drives how the programmer should structure their code and data. These are implementation strategy patterns and include:\n\n- Master/Worker\n\n- Loop Parallelism\n\n- Fork/Join\n\n- Shared Data and Queues\n\n- Active Messaging\n\n\n\nPatterns are described on an abstract level and we will also discuss enhancements that can be made to improve performance/scalability but at the cost of code complexity. Implementations of these patterns are explored in depth in the tutorials.\n\nThis module also covers parallel frameworks and how we might write generic implementations of patterns which can be applied to numerous problems. Design principals of frameworks, along with popular HPC libraries will be explored so that students understand both from a design and also implementation perspective how to write generic parallel code. \n\n\n\nProgramming exercises use C and Fortran, with MPI and OpenMP."},
{"courseName": "MSc by Research Thesis (Data Science)", "EUCLID Code": "INFR11106", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11106.htm", "Acronym": "RTDS", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "90", "Year": "5", "Delivery": "B5+", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Adam Lopez", "Summary": "Students will pursue an eight-month research project in Data Science which results in a written dissertation. The research must demonstrate competence, knowledge, and be presented in a critical and scholarly way, demonstrating that the student is capable of undertaking independent research.", "Description": "Project dependent."},
{"courseName": "Natural Language Understanding, Generation, and Machine Translation", "EUCLID Code": "INFR11157", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11157.htm", "Acronym": "NLU+", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "20", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Adam Lopez", "Summary": "**This course replaces Natural Language Generation (Level 11) (INFR11060), Machine Translation (Level 11) (INFR11062) and Natural Language Understanding (Level 11) (INFR11061).**\n\n\n\nThis course explores current research on processing natural language: interpreting, generating, and translating. The course will focus mainly on deep learning approaches to various NLP tasks and applications. It will provide an introduction to the main neural network architectures used in NLP and how they are used for tasks such as syntactic and semantic parsing, as well as end-user applications such as machine translation and text summarization.\n\nBuilding on linguistic and algorithmic knowledge taught in prerequisite courses, this course also aims to further develop students' understanding of the strengths and weaknesses of current approaches with respect to linguistic and computational considerations. Practical assignments will provide the opportunity to implement and analyse some of the approaches considered.", "Description": "The course aims to familiarize students with recent research across a range of topics within NLP, mainly within the framework of neural network models, and with a focus on applications such as machine translation, summarisation, and semantic parsing. As an MSc-level course that assumes previous experience with NLP, it will discuss a range of different issues, including linguistic/representational capacity, computational efficiency, optimization, etc. There is no textbook for the course; readings will come from recent research literature."},
{"courseName": "Natural Computing (Distance Learning)", "EUCLID Code": "INFR11165", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11165.htm", "Acronym": "NAT-DL", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Michael Herrmann", "Summary": "*Please note that this is an online learning course, aimed at students on the DSTI or Informatics distance learning programmes*.\n\n\n\nThis module teaches you about bio-inspired algorithms for optimisation and search problems. The algorithms are based on simulated evolution (including Genetic algorithms and Genetic programming), particle swarm optimisation, ant colony optimisation as well as systems made of membranes or biochemical reactions among molecules. These techniques are useful for searching very large spaces. For example, they can be used to search large parameter spaces in engineering design and spaces of possible schedules in scheduling. However, they can also be used to search for rules and rule sets, for data mining, for good feed-forward or recurrent neural nets and so on. The idea of evolving, rather than designing, algorithms and controllers is especially appealing in AI. In a similar way it is tempting to use the intrinsic dynamics of real systems consisting e.g. of quadrillions of molecules to perform computations for us. The course includes technical discussions about the applicability and a number of practical applications of the algorithms.\n\n\n\nIn this module, students will learn about\n\n\n\n- The practicalities of natural computing methods: How to design algorithms for particular classes of problems.\n\n\n\n- Some of the underlying theory: How such algorithms work and what is provable about them. \n\n\n\n- Issues of experimental design: How to decide whether an metaheuristic algorithm works well. \n\n\n\n- Current commercial applications. \n\n\n\n- Current research directions.", "Description": "The lectures will cover the following subjects:\n\n\n\n- Computational aspects of animal behaviour and of biological, chemical or physical systems.\n\n- The basics of Genetic Algorithms: selection, recombination and mutation, fitness and objective functions\n\n- Variants of GAs: different types of crossover and mutation, of selection and replacement. Inversion and other operators, crowding, niching, island and cellular models\n\n- Theory: the schema theorem and its flaws; selection takeover times; statistical mechanics approaches as a theoretical basis for studying GA issues\n\n- Hybrid algorithms, memetic algorithms\n\n- Pareto optimisation\n\n- Ant Colony Optimisation: Basic method for the travelling salesperson problem, local search, application to bin packing, tuning, convergence issues and complexity.\n\n- Swarm intelligence, particle swarms, differential evolution.\n\n- Greedy randomized adaptive search procedure\n\n- DNA computing, molecular computing, membrane computing.\n\n- Applications such as engineering optimisation; scheduling and timetabling; data-mining; neural net design.\n\n- Comparisons among metaheuristic algorithms, no-free-lunch theorems \n\n- Experimental issues: design and analysis of sets of experiments.\n\n\n\nRelevant QAA Computing Curriculum Sections: Artificial Intelligence, Data Structures and Algorithms, Simulation and Modelling"},
{"courseName": "Natural Computing", "EUCLID Code": "INFR11161", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11161.htm", "Acronym": "NAT", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Michael Herrmann", "Summary": "This module teaches you about bio-inspired algorithms for optimisation and search problems. The algorithms are based on simulated evolution (including Genetic algorithms and Genetic programming), particle swarm optimisation, ant colony optimisation as well as systems made of membranes or biochemical reactions among molecules. These techniques are useful for searching very large spaces. For example, they can be used to search large parameter spaces in engineering design and spaces of possible schedules in scheduling. However, they can also be used to search for rules and rule sets, for data mining, for good feed-forward or recurrent neural nets and so on. The idea of evolving, rather than designing, algorithms and controllers is especially appealing in AI. In a similar way it is tempting to use the intrinsic dynamics of real systems consisting e.g. of quadrillions of molecules to perform computations for us. The course includes technical discussions about the applicability and a number of practical applications of the algorithms.\n\n\n\nIn this module, students will learn about\n\n\n\n- The practicalities of natural computing methods: How to design algorithms for particular classes of problems.\n\n\n\n- Some of the underlying theory: How such algorithms work and what is provable about them. \n\n\n\n- Issues of experimental design: How to decide whether an metaheuristic algorithm works well. \n\n\n\n- Current commercial applications. \n\n\n\n- Current research directions.", "Description": "The lectures will cover the following subjects:\n\n\n\n- Computational aspects of animal behaviour and of biological, chemical or physical systems.\n\n- The basics of Genetic Algorithms: selection, recombination and mutation, fitness and objective functions\n\n- Variants of GAs: different types of crossover and mutation, of selection and replacement. Inversion and other operators, crowding, niching, island and cellular models\n\n- Theory: the schema theorem and its flaws; selection takeover times; statistical mechanics approaches as a theoretical basis for studying GA issues\n\n- Hybrid algorithms, memetic algorithms\n\n- Pareto optimisation\n\n- Ant Colony Optimisation: Basic method for the travelling salesperson problem, local search, application to bin packing, tuning, convergence issues and complexity.\n\n- Swarm intelligence, particle swarms, differential evolution.\n\n- Greedy randomized adaptive search procedure\n\n- DNA computing, molecular computing, membrane computing.\n\n- Applications such as engineering optimisation; scheduling and timetabling; data-mining; neural net design.\n\n- Comparisons among metaheuristic algorithms, no-free-lunch theorems \n\n- Experimental issues: design and analysis of sets of experiments.\n\n\n\nRelevant QAA Computing Curriculum Sections: Artificial Intelligence, Data Structures and Algorithms, Simulation and Modelling"},
{"courseName": "Music Informatics", "EUCLID Code": "INFR11079", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11079.htm", "Acronym": "MI", "AI": "AI", "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Alan Smaill", "Summary": "The course covers the principal theories, techniques and algorithms developed recently to give computational accounts of how musical phenomena can be analysed, generated and mediated with machine support or collaboration. The emphasis is on concepts, rather than tools, but the ideas have wide applicability. The state of the art is presented in selected areas.", "Description": "Background\n\n* Physics of music vs musical perception,\n\n* Music Representation \n\n\n\nBasic parameters\n\n\n\nBasic Local Analysis Algorithms\n\n* Beat tracking; score following\n\n* Tonal centre (Longuet-Higgins, Bolzano) \n\n\n\nMusical Grammars\n\n    \n\nMusical Similarity\n\n    \n\nInformation Theory, Statistical methods\n\n* Characterising musical style\n\n* Music generated by statistical constraints (Xenakis) \n\n\n\nMachine Composition in a Given Style\n\n    \n\nMusical Agents and Interaction\n\n\n\nRelevant QAA Computing Curriculum Sections: Not yet available"},
{"courseName": "Message-passing Programming", "EUCLID Code": "INFR11163", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11163.htm", "Acronym": "EPCC/10", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "Parallel programming by definition involves co-operation between processors to solve a common problem. The programmer has to define the tasks that will be executed by the processors, and also how these tasks exchange data and synchronise with each other.\n\n\n\nIn the message-passing model the tasks are separate processes that communicate by explicitly sending each other messages. All parallel operations are performed via calls to some message-passing interface that is entirely responsible for interfacing with the physical communication network.\n\n\n\nThis course uses the de facto standard for message passing, the Message Passing Interface (MPI), which is a library callable from C, C++ or Fortran.  Parallel programs written using MPI can run on almost any system from a multicore laptop up to the largest supercomputers in the world.", "Description": "The course will cover the following topics:\n\n\n\n- The message-passing model\n\n- Message-passing parallelisation of a regular domain code\n\n- MPI terminology\n\n- The anatomy of send and receive (synchronous and asynchronous)\n\n- Point-to-point message-passing examples\n\n- Non-blocking operations\n\n- Collectives\n\n- Communicator management \n\n- Derived datatypes (focusing mainly on array subsections)\n\n- Practicalities / Hints and Tips"},
{"courseName": "MSc by Research Thesis (Data Science; 120pt)", "EUCLID Code": "INFR11107", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11107.htm", "Acronym": "RTDS+", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "120", "Year": "5", "Delivery": "YR", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Adam Lopez", "Summary": "Students will pursue a year long research project in Data Science which results in a written dissertation. The research must demonstrate competence, knowledge, and be presented in a critical and scholarly way, demonstrating that the student is capable of undertaking independent research.\n\n\n\nFor this 120 credit project, the dissertation will normally include a more extensive investigation and critical evaluation of the topic, the use of more advanced methodology, or more time-intensive research methods than in a 90 credit project.", "Description": "Project dependent."},
{"courseName": "MSc Dissertation (Informatics)", "EUCLID Code": "INFR11077", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11077.htm", "Acronym": "DISS", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "60", "Year": "5", "Delivery": "B5+", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Richard Mayr", "Summary": "This is a major piece of full-time independent work which occupies the final months of the MSc course. It is intended to allow students to demonstrate their ability to organise and carry out a substantial investigation into a problem in Informatics, according to sound scientific and engineering principles. The project involves both the application of skills learnt in the past and the acquisition of new skills.\n\n\n\nThe types of activity involved in each project will vary but will include most of the following:\n\n\n\n    * Researching the literature and gathering background information.\n\n    * Analysing requirements, comparing alternatives and specifying a solution.\n\n    * Analysing and extending relevant theory in novel ways.\n\n    * Designing and implementing the solution.\n\n    * Experimenting with and evaluating the solution.\n\n    * Discussing existing results and presenting new research.\n\n    * Developing written and oral presentation skills.\n\n\n\nThe project is conducted individually by the student under the supervision of a member of teaching staff. Students are formed into groups for the purpose of a Review Meeting.", "Description": "Project dependent"},
{"courseName": "MInf Project (Part 2)", "EUCLID Code": "INFR11093", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11093.htm", "Acronym": "MIP2", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "40", "Year": "5", "Delivery": "FLEX", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Don Sannella", "Summary": "This is the second half a major project that runs over the fourth and fifth years. It is intended to allow students to demonstrate their ability to organise and carry out a substantial piece of work. The project involves both the application of skills learnt in the past and the acquisition of new skills. Typical areas of activity will be: gathering and understanding background information; solving conceptual problems; design; implementation; experimentation and evaluation; writing up.\n\nThe project is conducted individually by the student under the supervision of a member of teaching staff. The project specification is usually provided by a member of staff, but students are also free to specify their own project. All project specifications must be approved by the Project Coordinator.\n\nThe project will normally involve the construction of an artifact, whether software, hardware, a robotic device, some other artifact incorporating computation, or some combination of these.\n\nThis second half continues from MInf Project (Part 1) starting with work identified in the Conclusion section of the report for MInf Project (Part 1). It is expected that work here will go into greater depth, the work carried out is not necessarily limited to that which was identified in MInf Project (Part 1).", "Description": "Project dependent"},
{"courseName": "MInf Project (Part 1)", "EUCLID Code": "INFR10051", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10051.htm", "Acronym": "MIP1", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "10", "Points": "40", "Year": "4", "Delivery": "FLEX", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Don Sannella", "Summary": "This is the first half a major project that runs over the fourth and fifth years. It is intended to allow students to demonstrate their ability to organise and carry out a substantial piece of work. The project involves both the application of skills learnt in the past and the acquisition of new skills. Typical areas of activity will be: gathering and understanding background information; solving conceptual problems; design; implementation; experimentation and evaluation; writing up.\n\n\n\nThe project is conducted individually by the student under the supervision of a member of teaching staff. The project specification is usually provided by a member of staff, but students are also free to specify their own project. All project specifications must be approved by the Project Coordinator.\n\n\n\nThe project will normally involve the construction of an artifact, whether software, hardware, a robotic device, some other artifact incorporating computation, or some combination of these.\n\n\n\nThis first half consists of a project that is essentially self contained but it should be planned in such a way as to allow for expansion and greater depth for the following year. Note that as this is the first half of an 80 point project it is recognized that a longer planning phase might be involved as compared to a standard UG4 project. In any case, the report should include a clear account of this aspect along with a justification.", "Description": "Project dependent"},
{"courseName": "Introductory Applied Machine Learning (Distance Learning)", "EUCLID Code": "INFR11152", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11152.htm", "Acronym": "IAML-DL", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "50/50", "Lecturer(s)/Coordinator(s)": "Nigel Goddard", "Summary": "*This course is for distance learning students within the School of Informatics and students on the Data Science, Technology & Innovation programme*.\n\n\n\nOrganisations seek to make better decisions by examining their data with an aim to discovering and/or drawing conclusions about the information contained within. This course is about the principled application of machine learning techniques to extracting information from data. The main area that will be discussed is supervised learning, which is concerned with learning to predict an output, given inputs. A second area of study is unsupervised learning, where we wish to discover the structure in a set of patterns, i.e. there is no output \"teacher signal\". The primary aim is to provide the student with a set of practical tools that can be applied to solve real - world problems in machine learning, coupled with an appropriate, principled approach to formulating a solution.\n\n\n\nThis distance-based course is aligned with the on-campus Introductory Applied Machine Learning course (INFR11181), which uses a flipped classroom delivery approach. Distance students will cover the same or similar materials, have the same coursework, engage in the same or similar classroom activities, and take the same exam as the on-campus students.", "Description": "This course is delivered using \"flipped-classroom\" methods. Intellectual content will be delivered via a combination of online short video segments (overall, per topic, approximately the same length as a traditional lecture). Some of the topics have online quizzes associated with them, intended for you to review your understanding. During most of the lecture slots we will have other activities to review the topic material, also available by online recording.\n\n\n\nWe expect to cover the following general areas:\n\n\n\n1.\tReview of maths and probability\n\n2.\tFeature engineering (e.g., basis transforms, selection , Principal Components Analysis)\n\n3.\tClassification vs. Regression\n\n4.\tSupervised methods (e.g., Naive Bayes, Decision Trees and Random Forests, Linear & Logistic Regression, Support Vector Machines, Nearest Neighbours, Neural Networks)\n\n5.\tUnsupervised clustering methods (e.g., k-Means, Gaussian Mixture Models, Hierarchical Clustering)\n\n\n\nWe will use a modern machine learning programming environment and industry-standard libraries."},
{"courseName": "Introduction to Vision and Robotics (Distance Learning)", "EUCLID Code": "INFR11153", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11153.htm", "Acronym": "IVR-DL", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Timothy Hospedales", "Summary": "*This course is available to distance learning students within the School of Informatics and students on the Data Science, Technology & Innovation programme.*\n\n\n\nThe course introduces the basic concepts and methods in the field of robotics and computer vision.", "Description": "Robotics and Vision applies AI techniques to the problems of making devices capable of interacting with the physical world. This includes moving around in the world (mobile robotics), moving things in the world (manipulation robotics), acquiring information by direct sensing of the world (e.g. machine vision) and, importantly, closing the loop by using sensing to control movement. Applying AI in this context poses certain problems, and sets certain limitations, which have important effects on the general software and hardware architectures. For example, a robot with legs must be able to correct detected imbalances before it falls over, and a robot which has to look left and right before crossing the road must be able to identify approaching hazards before it gets run over. These constraints become much more serious if the robot is required to carry both its own power supply and its own brain along with it. This course introduces the basic concepts and methods in these areas, and serves as an introduction to the more advanced robotics and vision modules."},
{"courseName": "Introductory Applied Machine Learning", "EUCLID Code": "INFR10069", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10069.htm", "Acronym": "IAML", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "10", "Points": "20", "Year": "3", "Delivery": "S1", "Exam Diet": "December; December", "Work%/Exam%": "50/50", "Lecturer(s)/Coordinator(s)": "Pavlos Andreadis", "Summary": "Since the early days of AI, researchers have been interested in making computers learn, rather than simply programming them to do tasks. This is the field of machine learning. The main area that will be discussed is supervised learning, which is concerned with learning to predict an output, given inputs. A second area of study is unsupervised learning, where we wish to discover the structure in a set of patterns; there is no output 'teacher signal'.\n\n\n\nThe primary aim of the course is to provide the student with a set of practical tools that can be applied to solve real-world problems in machine learning, coupled with an appropriate, principled approach to formulating a solution.\n\n\n\nThis 20 credit course replaces INFR10063 Introductory Applied Machine Learning (10 credits).", "Description": "Introduction to Machine Learning and its Goals. Introduction to Data and Models. Memory based methods. Decision Trees. Error functions, Minimizing Error. Regression, Logistic Regression, Neural Networks. Margin Based Methods: Perceptron, Support Vector Machines. Naïve Bayes. Dimensionality Reduction. Clustering: K-means, Simple Gaussian Mixture Models, Hierarchical Clustering. Boosting Approaches. Model Averaging, Mixtures of Experts. Evaluation of Performance.\n\n\n\n[We will also use a modern machine learning programming environment]"},
{"courseName": "Introduction to Vision and Robotics", "EUCLID Code": "INFR09019", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09019.htm", "Acronym": "IVR", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "9", "Points": "10", "Year": "3", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Michael Herrmann", "Summary": "Robotics and Vision applies AI techniques to the problems of making devices capable of interacting with the physical world. This includes moving around in the world (mobile robotics), moving things in the world (manipulation robotics), acquiring information by direct sensing of the world (e.g. machine vision) and, importantly, closing the loop by using sensing to control movement. Applying AI in this context poses certain problems, and sets certain limitations, which have important effects on the general software and hardware architectures. For example, a robot with legs must be able to correct detected imbalances before it falls over, and a robot which has to look left and right before crossing the road must be able to identify approaching hazards before it gets run over. These constraints become much more serious if the robot is required to carry both its own power supply and its own brain along with it. This module introduces the basic concepts and methods in these areas, and serves as an introduction to the more advanced robotics and vision modules.", "Description": "The issues addressed will include the following:\n\n\n\n* Applications of robotics and vision; the nature of the problems to be solved; historical overview and current state of the art.\n\n* Robot actuators and sensors. Parallels to biological systems.\n\n* Robot control: Open-loop, feed-forward and feedback; PID (proportional integral differential) control.\n\n* Image formation, transduction and simple processing; thresholding, filtering and classification methods for extracting object information from an image.\n\n* Active vision and attention.\n\n* Sensors for self monitoring.\n\n* General approaches and architectures. Classical vs. behaviour-based robotics. Wider issues and implications of robot research. \n\n\n\nThe course also involves hands-on practicals in which vision and robot systems will be programmed.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Artificial Intelligence; Computer Vision and Image Processing"},
{"courseName": "Introduction to Theoretical Computer Science", "EUCLID Code": "INFR10059", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10059.htm", "Acronym": "ITCS", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "10", "Points": "10", "Year": "3", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Chris Heunen", "Summary": "This course introduces the fundamental concepts of the theory of computer science: what does `computing' mean? Are all `computers' basically the same? Can we tell whether our programs are `correct' - and what does `correct' mean, anyway? Can we solve problems in reasonable time, and can we tell whether we can?\n\nThe course concentrates primarily on conceptual understanding, but adds enough detail to allow students to go on to further courses, and illustrates how the fundamental concepts are reflected throughout the discipline.", "Description": "The first section of the course asks the question, what does it mean to compute? We start with very simple abstract computers, and argue they can do everything real computers can do. We then ask, can we solve every computational question? The answer, which which Turing shocked the mathematicians of the 1930s, is \"no\", with a remarkably easy but beautiful argument (introduced at the end of Inf2A). We then explore some different, but always equivalent, ways of defining \"a computer\". We finish the section by asking how we can compare the difficulty of different problems, and introduce the idea of \"reduction\" as a way of compiling one problem into another. Technically, this covers register machines, undecidability, Turing machines, and reductions. \n\n\n\nThe second section thinks about how hard it is to solve solvable problems, leading to one of the most important problems in all mathematics, and the foundation of internet security. We start by reprising Inf2A analysis of algorithms, and then discuss the idea of classifying problems as `tractable' (easy) or `intractable' (hard). We find that the idea of algorithms whose running time grows polynomially in the problem size is a good mathematical definition of `tractable', though not always a practical one. After making this more precise, we ask what happens if we're allowed to just check all the possible answers in parallel - does this give us more problem-solving power? The question is made precise by the concept of NP, and we show that there are \"hardest\" such problems, such as the famous Travelling Salesman. Although the question is easy to ask, nobody knows how to answer it. This is P = NP - if you can solve it, you win a million dollars, and fame for as long as civilization lasts.   So far, NP problems are very hard to solve in practice, so we discuss how to deal with them. We finish the section by talking about much harder problems still. Technically, this section covers P, NP, hardness and completeness, Cook's Theorem, P = NP, and the complexity hierarchy above NP. \n\n\n\nThe third section considers a different way of seeing computation. Haskell needn't be seen as a programming language, it can be the computer itself. We'll show how the lambda-calculus (on which Haskell is based) can do all the computing our other models could. Unlike the register and Turing machines, lambda-calculus lets us easily use types, which get rid of a whole class of possible bugs from our programs. This \"typing\" underlies almost all modern languages, including such recent things as generics in Java. We'll show how we can decide whether a lambda program is correct in its type, and even how we can do the typing automatically, instead of making the programmer do it. It turns out that this latter is one of those weird problems that is ridiculously hard in theory, but perfectly doable in practice, which bring us back to the complexity hierarchies of the second section. Technically, this covers lambda-calculus, simple types, polymorphism, type checking and type inference. \n\n\n\n\n\nRegister and Turing machines, undecidability, reductions. Intractability and growth rates. P and poly-time reductions, NP, hardness and completeness. Cook's Theorem. P = NP. Beyond NP. Lambda-calculus, through to simply-typed lambda, type safety, polymorphism, type inference and Hindley-Milner."},
{"courseName": "Introduction to Research in Data Science", "EUCLID Code": "INFR11138", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11138.htm", "Acronym": "IRDS", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Amos Storkey", "Summary": "This course provides students with an overview of current research topics in data science. This overview is provided by guest lectures from researchers working throughout different areas of data science, including databases, machine learning, maths, natural language processing, computer vision, speech processing, and related areas.\n\n\n\nSecond, this course also features a small project to provide students with experience in applying data science methods. The goal of the project is to apply an existing data science method to a interesting real or realistic problem. The student will produce a short project report and poster presentation based on the project.", "Description": "This course provides students with an overview of current research topics in data science. This overview is provided by guest lectures from researchers working throughout different areas of data science, including databases, machine learning, maths, natural language processing, computer vision, speech processing, and related areas.\n\n\n\nSecond, this course also features a small project to provide students with experience in applying data science methods. The goal of the project is to apply an existing data science method to a interesting real or realistic problem. The student will produce a short project report and poster presentation based on the project."},
{"courseName": "Introduction to Quantum Computing", "EUCLID Code": "INFR11099", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11099.htm", "Acronym": "IQC", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "VUG: December; April/May", "Work%/Exam%": "10/90", "Lecturer(s)/Coordinator(s)": "Petros Wallden", "Summary": "The aim of this course is to give students a basic overview of the rapidly growing field of Quantum Computation (QC). The course will start with a brief introduction of the mathematical framework of QC. The two models of quantum circuit and measurement-based quantum computing, will be introduced. Through these models various key concepts in QC such as entanglement and teleportation will be discussed. In order to compare QC and classical computing, simple quantum algorithms with their complexity analysis will be presented. We finish the course by highlighting the recent development of the field in secure delegated QC.", "Description": "- Basic concepts from Linear Algebra necessary for understanding the axioms of Quantum Mechanics,\n\n- Axioms of Quantum Mechanics, describing quantum system, quantum operators, composition, entanglement and measurements\n\n- The no cloning, no deleting theorems and the consequences for computation\n\n- Quantum Computing via quantum circuit model: Description of qubit and universal set of gates.\n\n- Quantum space and depth complexity and oracle model\n\n- Classical simulation of quantum circuit and Gottesman-Knill Theorem\n\n- Quantum Algorithms: Grover¿s Search and Deutsch-Jozsa problem\n\n- The first quantum protocols: Quantum teleportation and super dense coding\n\n- Quantum Computing via measurement-based model: Description of graph state and measurement calculus\n\n- Advanced Topics: Information flow in measurement-based model, unconditionally secure quantum cloud computing"},
{"courseName": "Introduction to Modern Cryptography", "EUCLID Code": "INFR11131", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11131.htm", "Acronym": "IMC", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "10/90", "Lecturer(s)/Coordinator(s)": "Vassilis Zikas", "Summary": "Cryptography is the formal study of the notion of security in information systems. The course will offer a thorough introduction to modern cryptography focusing on models and proofs of security for various basic cryptographic primitives and protocols including key exchange protocols, commitment schemes, digital signature algorithms, oblivious transfer protocols and public-key encryption schemes.   Applications to various problems in secure computer and information systems will be briefly discussed including secure multiparty computation, digital content distribution, e-voting systems, digital payment systems, cryptocurrencies.", "Description": "The area of cryptography focuses on various problems pertaining to secure communication and computation. It entails the study of models that express security properties as well as the algorithms and protocols that are the implementation candidates for satisfying these properties. An important dimension of modern cryptography is the design of security proofs that establish security properties. Such proofs are conditional on assumptions that fall in two categories: \"system assumptions\" such as the faithful execution of code, or the availability of private randomness and \"computational assumptions\" that are related to the computational complexity of various problems (including factoring large numbers and others). Students will learn to model security problems, design protocols and prove them secure under precisely formulated system and computational assumptions."},
{"courseName": "Introduction to Java Programming (Distance Learning)", "EUCLID Code": "INFR09050", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09050.htm", "Acronym": "IJP-DL", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "9", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Paul Anderson", "Summary": "*This course is for distance learning students within the School of Informatics and students on the Data Science, Technology & Innovation Programme*.\n\n\n\nThis module is intended for students who have some previous programming experience, but would like to develop their ability to write complete, practical applications. Students with no programming experience should be able to complete the course, although this will almost certainly be challenging and will require additional time. The course uses an object-oriented approach, based around the Java language, but no previous experience of specific languages or technologies is assumed. \n\n\n\nThis distance-based course is aligned with the on-campus Introduction to Java Programming course (INFR09021) which uses a flipped classroom delivery approach. Distance students will cover the same materials, engage in the same classroom activities (but using Collaborate) and undertake the same assessment as the on-campus students.", "Description": "Learning to program requires practice, and students on this course typically have very diverse programming backgrounds. Locating and working with online materials is also an essential skill for developing real applications. For these reasons, the course has no regular lectures on the content - it is facilitated by structured assignments, a recommended textbook, online materials, well-supported lab sessions (or online tutorials for distance learning students), and an online forum. This provides a flexible learning environment, and students should be prepared to manage their own schedule and to take advantage of the resources in a way which is most appropriate to their own experience.\n\n\n\nThe course content includes the following topics: \n\n- Object-oriented design - classes, objects, inheritance, coupling, cohesion, responsibility.\n\n- The basics of the Java programming language.\n\n- The use of external libraries - collections, graphical interfaces, networking.\n\n- Development tools.\n\n- Code readability and documentation.\n\n- Graphical user interfaces.\n\n\n\nRelevant QAA Computing Curriculum Sections: Programming Fundamentals."},
{"courseName": "Introduction to Java Programming", "EUCLID Code": "INFR09021", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09021.htm", "Acronym": "IJP", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "9", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Paul Anderson", "Summary": "This module is intended for students who have some previous programming experience, but would like to develop their ability to write complete, practical applications. Students with no programming experience should be able to complete the course, although this will almost certainly be challenging and will require additional time. The course uses an object-oriented approach, based around the Java language, but no previous experience of specific languages or technologies is assumed.", "Description": "Learning to program requires practice, and students on this course typically have very diverse programming backgrounds. Locating and working with online materials is also an essential skill for developing real applications. For these reasons, the course has no regular lectures on the content - it is facilitated by structured assignments, a recommended textbook, online materials, well-supported lab sessions (or online tutorials for distance learning students), and an online forum. This provides a flexible learning environment, and students should be prepared to manage their own schedule and to take advantage of the resources in a way which is most appropriate to their own experience.\n\n\n\nThe course content includes the following topics: \n\n- Object-oriented design - classes, objects, inheritance, coupling, cohesion, responsibility.\n\n- The basics of the Java programming language.\n\n- The use of external libraries - collections, graphical interfaces, networking.\n\n- Development tools.\n\n- Code readability and documentation.\n\n- Graphical user interfaces.\n\n\n\nRelevant QAA Computing Curriculum Sections: Programming Fundamentals."},
{"courseName": "Internet of Things Systems, Security, and the Cloud (IoTSSC)", "EUCLID Code": "INFR11146", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11146.htm", "Acronym": "IoTSSC", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "20", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "55/45", "Lecturer(s)/Coordinator(s)": "Paul Patras", "Summary": "IoTSSC will teach students fundamentals concepts of Internet of Things (IoT) systems, wireless communication paradigms employed in IoT, security and privacy issues, and cloud integration. The course will involve a major coursework that will require students to work in pairs to design, build, and evaluate a practical IoT system. Students will be required to demonstrate their prototypes and present orally their projects at the end of the course, and document their designs and results in a workshop style research paper.", "Description": "The course will cover IoT systems architecture, hardware platforms, relevant wireless technologies and networking protocols, security and privacy concepts, device programming and debugging, cloud integration, simple data analytics, and commercialisation challenges. The students should expect to be able to apply the taught concepts in the development of an IoT prototype."},
{"courseName": "Informatics Research Review", "EUCLID Code": "INFR11136", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11136.htm", "Acronym": "IRR", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Bjoern Franke", "Summary": "This course provides students with the opportunity to explore an area of interest in more depth than allowed in a standard taught course. For MSc students this is expected to take the form of reviews of the literature in topics related to their specialism.\n\n\n\nThis 10 credit course replaces Informatics Research Review (Level 11) (INFR11034) - 20 credit course.", "Description": "Students and tutors will be matched up based on interests/specialisms at the start of semester 1. Students will be given examples of good reviews, guidance on literature reviewing, literature searching and citation methods. In addition they may be directed towards research seminars in relevant topics. The student should then explore the general area over the semester in consultation with their tutor. It is expected that each student will submit two minor reviews that critically evaluate a single research paper or seminar presentation during the first half of the semester. During the latter half of the semester, students will produce a substantial review of a research area."},
{"courseName": "Informatics Project Proposal", "EUCLID Code": "INFR11147", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11147.htm", "Acronym": "IPP", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Bjoern Franke", "Summary": "The aim of this course is to develop generic research and/or practical skills that can be deployed in academic or commercial environments. Students will demonstrate their ability to develop interesting concepts and/or hypotheses into proposals appropriate for a larger research- or implementation-based project and demonstrate their ability to identify legal, social, ethical and professional issues.", "Description": "Structure and delivery of this course will vary according to the nature of the project, and will be agreed between student and supervisor at the start of the semester. Representative activities might include literature review, data preparation, preliminary implementation, or establishing connections and gathering requirements from stakeholders. The student will then produce a project proposal that explains the hypotheses and/or goals, project management, and milestones with approximate times with some justification for these decisions. Key methodologies should be introduced.\n\nThis 10 credit course replaces Informatics Research Proposal (Level 11) (INFR11137) and Informatics Research Proposal (Level 11) (INFR11071) - 20 credit course."},
{"courseName": "Informatics Large Practical", "EUCLID Code": "INFR09051", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09051.htm", "Acronym": "ILP", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "9", "Points": "20", "Year": "3", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Pavlos Andreadis", "Summary": "**This course replaces AI Large Practical (INFR09043), Software Engineering Large Practical (INFR09045) and Computer Science Large Practical (INFR09044).**\n\n\n\nThe Informatics Large Practical exposes students to the problems that arise with the design and implementation of large-scale software systems, and to methods of coping with such problems.\n\n\n\nStudents will gain experience in how to:\n\n- Schedule their work load\n\n- Design clearly and coherently structured systems\n\n- Discover and use relevant technical information\n\n- Implement a large-scale software system\n\n- Design and run experiments and tests\n\n- Analyse and report results\n\n- Present their work in a clear and concise way.", "Description": "The Informatics Large Practical gives students experience in developing a non-trivial software system and reporting on the end product. In this way, the practical provides an introduction to the issues and requirements of the more demanding fourth-year project. In particular, the student gains practical experience of:\n\n\n\n- Reading technical material and identifying the important content\n\n- Identifying and formalising project requirements\n\n- Identifying computational problems and inventing algorithmic solutions\n\n- Constructing a detailed design which does not over-commit to implementation detail\n\n- Implementing and testing a software application which realises the design\n\n- Experimenting with the implementation to explore the solutions to the computational problems\n\n- Writing a report which documents the solutions and the implementation\n\n- Managing a software project using a source-code repository."},
{"courseName": "Informatics 2D - Reasoning and Agents", "EUCLID Code": "INFR08010", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08010.htm", "Acronym": "INF2D", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "20", "Year": "2", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Vaishak Belle", "Summary": "This course focuses on approaches relating to representation, reasoning and planning for solving real world inference. The course illustrates the importance of (i) using a smart representation of knowledge such that it is conducive to efficient reasoning, and (ii) the need for exploiting task constraints for intelligent search and planning. The notion of representing action, space and time is formalized in the context of agents capable of sensing the environment and taking actions that affect the current state. There is also a strong emphasis on the ability to deal with uncertain data in real world scenarios and hence, the planning and reasoning methods are extended to include inference in probabilistic domains.", "Description": "1.  Intelligent Agents: Introduction\n\n* Nature of agents, performance measures and environments\n\n* Wumpus World Problem : An example thread (Programming environment setup \n\n\n\n2. Search based Planning\n\n* Planning as a Search Problem: In deterministic, observable, static and known environments\n\n* Smart Searching 1: Using constraints\n\n* Smart Searching 2: Exploiting subproblems/Memoisation\n\n* Informed Search and Exploration for agents \n\n\n\n3. Logical Representation and Planning\n\n* Propositional Logic Revisited (Shortcomings)\n\n* First Order Logic & Encoding facts/rules in FOL\n\n* Inference Rules for Propositional & FOL Calculus\n\n* Unification and Generalized Modus Ponens\n\n* Resolution based Inference and directing search with it\n\n* Knowledge representation : Using FOL to represent action, space, time -- Wumpus Example\n\n* Situation Calculus: Representing time in plans \n\n\n\n4. Scaling Planning for Complex Tasks\n\n* Representing States, Goals and Actions in STRIPS\n\n* Partial Order Planning\n\n* Planning and Acting in the Real World \n\n\n\n5. Acting in Uncertain (real world) Environments\n\n* Representation with Bayes Net\n\n* Probabilistic Reasoning in Bayes Net\n\n* Planning under Uncertainity : Wumpus world revisited\n\n* Probabilistic Reasoning over Time I: hidden markov models\n\n* Probabilistic Reasoning over Time II: dynamic Bayesian networks\n\n* Markov Decision Processes \n\n\n\nRelevant QAA Computing Curriculum Sections:  Artificial Intelligence, Human-Computer Interaction (HCI), Intelligent Information Systems Technologies, Simulation and Modelling"},
{"courseName": "Informatics 2C - Introduction to Computer Systems", "EUCLID Code": "INFR08018", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08018.htm", "Acronym": "INF2C-CS", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "10", "Year": "2", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Boris Grot", "Summary": "This course is concerned with the design, implementation and engineering of digital computer systems. It offers an introduction to the internal structure of digital computers.", "Description": "The primary aim of the course is to convey an understanding of the internal structure and implementation of digital computers. To impart this knowledge, we first explain how the interface between hardware and software is typically constructed. This interface consists of several key components:\n\n\n\n* The binary representation and manipulation of atomic data.\n\n* The structure of a typical instruction set.\n\n* The environment in which a program executes, and the notion of processes and virtual memory.\n\n\n\nIn addition to explaining the interface between hardware and software, this course introduces the ideas behind the hardware implementation of a processor. This consists of several further components:\n\n\n\n* Combinational logic - how simple stateless building blocks such as adders, multiplexers and decoders can be constructed from logic \n\nelements.\n\n* Sequential logic - how components with state, such as latches,\n\nregisters, register files and memories can be constructed from logic elements.\n\n* Processor structure - how a simple instruction set can be implemented using combinational and sequential logic components.\n\n\n\nThis material is prefaced by a brief introduction to the C programming language, which is widely used as a systems programming language."},
{"courseName": "Informatics 2B - Algorithms, Data Structures, Learning", "EUCLID Code": "INFR08009", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08009.htm", "Acronym": "INF2B", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "20", "Year": "2", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Kyriakos Kalorkoti", "Summary": "This course presents key symbolic and numerical data structures and algorithms for manipulating them. Introductory numerical and symbolic learning methods provide a context for the algorithms and data structures. To make the presented ideas concrete, the module will extend the student's skills in Java and Matlab. Examples will be taken from all areas of Informatics.", "Description": "Algorithms and Data Structures:\n\n* Asymptotic notation and algorithms\n\n* Sequential data structures\n\n* Searching - including Hashing, AVL Trees, Heaps\n\n* Sorting - including Mergesort, Heapsort, Quicksort\n\n* Web-scale algorithms\n\n* Graphs\n\n\n\nLearning:\n\n* Statistical pattern recognition and machine learning\n\n* Multidimensional data\n\n* Discrete data and naive Bayes\n\n* Modelling and describing continuous data: nearest neighbours and clustering\n\n* Gaussians and linear discriminants\n\n* Single- and multi-layer networks\n\n\n\nRelevant QAA Computing Curriculum Sections:  Data Structures and Algorithms, Artificial Intelligence"},
{"courseName": "Informatics 2A - Processing Formal and Natural Languages", "EUCLID Code": "INFR08008", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08008.htm", "Acronym": "INF2A", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "20", "Year": "2", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Shay Cohen", "Summary": "This course is about processing natural and artificial languages, building on material covered in Informatics 1 concerning finite state machines and regular expressions. This course will consider how the same models of language can be used to describe and analyse both formal languages (such as programming languages) and natural languages (text and speech). It will include material on formal languages and grammars, probabilistic grammars (including hidden Markov models), semantic analysis and human language processing. Examples will be drawn from computer languages and natural language.", "Description": "* Grammars and the Chomsky Hierarchy\n\n* Regular languages, Finite state automata (FSA), probabilistic FSAs\n\n* Context-free languages and Push-down automata\n\n* Ambiguity and solutions to the problem\n\n* Deterministic parsers\n\n* Chart parsers\n\n* Probabilistic context-free grammars\n\n* Modelling semantics\n\n* Context-sensitive languages\n\n* Turing machines and computability\n\n* Models of human language processing\n\n* Overview of language technology\n\n\n\nRelevant QAA Computing Curriculum Sections:  Natural Language Computing; Theoretical Computing; Compilers and Syntax Directed Tools"},
{"courseName": "Informatics 1 - Object-Oriented Programming", "EUCLID Code": "INFR08014", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08014.htm", "Acronym": "INF1-OP", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "10", "Year": "1", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "Volker Seeker", "Summary": "This course presents a conceptual and practical introduction to object oriented programming, exemplified by Java. As well as providing a grounding in the use of Java, the course will cover general principles of programming in imperative and object oriented frameworks. After completing the course successfully, students will be able to develop programs that support experimentation, simulation and exploration in other parts of the Informatics curriculum (e.g. the capacity to implement, test and observe a particular algorithm).", "Description": "An introduction to the concepts of programming using a object oriented programming language.\n\n\n\nRelevant QAA Computing Curriculum Sections:  to be confirmed"},
{"courseName": "Informatics 1 - Introduction to Computation", "EUCLID Code": "INFR08025", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08025.htm", "Acronym": "INF1A", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "20", "Year": "1", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "5/95", "Lecturer(s)/Coordinator(s)": "Michael Fourman", "Summary": "**This 20 credit course replaces the two 10 credit courses - 'Informatics 1 - Functional Programming INFR08013' and 'Informatics 1 - Computation and Logic INFR08012' from 2018/19**.\n\n\n\nAn introduction to concepts of programming, using a functional programming language, and to concepts of computation and specification using finite-state systems and propositional logic. These provide examples of the logical ideas of syntax and semantics and the computational ideas of structure and behaviour. Students learn to specify, model and solve small-scale problems succinctly and at an abstract level.", "Description": "An introduction to concepts of programming, using the Haskell functional programming language, and to concepts of computation and specification, using finite-state machines and propositional logic. The use of sets, functions and relations to describe models of logic and computation. Programming using functions and data structures including lists and trees; case analysis, recursion and higher-order functions. Finite-state machines as a basic model of computation: deterministic and non-deterministic automata; regular expressions; acceptors; structured design of finite state machines. Propositional logic: truth tables; satisfiability; deduction. Applications from different areas will be used to illustrate and motivate the material."},
{"courseName": "Informatics 1 - Data and Analysis", "EUCLID Code": "INFR08015", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08015.htm", "Acronym": "INF1-DA", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "10", "Year": "1", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "Ian Stark", "Summary": "An introduction to collecting, representing and interpreting data across the range of informatics. Students will learn the different perspectives from which data is used, the different terminology used when referring to them and a number of representation and manipulation methods. The course will present a small number of running, illustrative examples from the perspectives of hypothesis testing and query formation and answering.", "Description": "Structured data and relational databases. Semistructured data and XML. Text corpora. Unstructured data and its analysis.\n\n\n\nRelevant QAA Computing Curriculum Sections:  to be confirmed"},
{"courseName": "Informatics 1 - Cognitive Science", "EUCLID Code": "INFR08020", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08020.htm", "Acronym": "INF1-CG", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "20", "Year": "1", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Frank Keller", "Summary": "This course is designed as a first introduction to Cognitive Science. It will provide a selective but representative overview of the subject, suitable for all interested students, including students on the Cognitive Science degrees and external students.\n\n\n\nThe aim of the lecturing team is to present a unified view of the field, based on a computational approach to analysing cognition. The material is organized by cognitive function (e.g., language, vision),\n\nrather than by subdiscipline (e.g., psychology, neuroscience).\n\n\n\nThe course covers language, vision and attention, memory, motor control and action, and reasoning and generalization. All topics will be presented from a computational point of view, and this perspective\n\nwill be reinforced by lab sessions in which students implement simple cognitive models. The course will also provide a basic grounding in the methods of Cognitive Science, focusing on\n\ncomputational modelling and experimental design.", "Description": "Course Description\n\n\n\nThe syllabus covers the following topics.\n\nThey are listed separately here, but in some cases they will be presented in an interleaved fashion:\n\n\n\n1. Language\n\n- the language faculty\n\n- models of linguistic data, words and rules theory\n\n- Connectionist models of language\n\n- language acquisition: speech segmentation, word learning, learning\n\nsyntactic categories\n\n- categorization and models of word meaning\n\n- understanding sentences\n\n\n\n2. Vision\n\n- the anatomy of vision, neural correlates of visual perception\n\n- Marr's model\n\n- fine vs. coarse coding\n\n- face recognition\n\n- reading\n\n\n\n3. Memory and Attention\n\n\n\n- types of memory, memory impairments, models of memory\n\n- attention, neglect\n\n\n\n4. Cognition and neuroscience\n\n- an introduction to cognitive neuroscience\n\n- some philosophical perspectives on the brain\n\n\n\n\n\n5. Reasoning and generalization\n\n- inductive reasoning\n\n- fallacies and (ir)rationality\n\n- models of abstraction and generalisation\n\n- theory formation and the origins of knowledge\n\n\n\n\n\nNote that this course is intended to give a high-level introduction to the topics listed; subsequent courses (e.g., Computational Cognitive Science) will then provide a more detailed coverage."},
{"courseName": "Image and Vision Computing (Distance Learning)", "EUCLID Code": "INFR11155", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11155.htm", "Acronym": "IVC-DL", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Timothy Hospedales", "Summary": "Distance Learning version of 'Image and Vision Computing ' (INFR11140). In this course we will learn how images are formed given the objects in the three dimensional world, and the basics of how computer vision inverts this process - computing properties of the world from digital images. We will cover topics including basic image formation, image processing, detection, matching and recognition that allow computers to understand the world based on image content.", "Description": "Learning Experience: The course will be delivered in a flipped format, with students watching recorded lectures and reading material, with the lecture functioning as a discussion session.\n\n\n\nContent: The course proceeds in five parts from foundational concepts such as image formation, through to low-level image processing operations, before building upon those to develop image representations, and use those representations for higher level tasks such as recognition and detection. The following four parts are roughly two weeks each.\n\n\n\nImage formation. The basic mathematics and physics of how images are formed based on light reflected by real-world objects. Includes ideal pinhole camera and lens models. Some basic 3D geometry, radiometry and photometry.\n\n\n\nLow-level image analysis. We will introduce basic algorithms such as convolution and filtering for image processing, and RANSAC for fitting. These will be applied for tasks such as edge detection, and line-fitting. To provide a taste of recognition students will perform shape recognition using Bayes theorem.\n\n\n\nImage Representations: To support working with more unconstrained realistic images, we next introduce feature representations for both local and global features including color histograms, HOG/SIFT, and descriptor bag of words.\n\n\n\nHigh-level image analysis: Building upon these image representations, we discuss the topical tasks of object recognition and sliding window-based object detection.\n\n\n\nApplications: Finally, we finish up with introduction to some applications including basic video processing (optical flow), and foreground detection."},
{"courseName": "Image and Vision Computing", "EUCLID Code": "INFR11140", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11140.htm", "Acronym": "IVC", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Timothy Hospedales", "Summary": "In this course we will learn how images are formed given the objects in the three dimensional world, and the basics of how computer vision inverts this process - computing properties of the world from digital images. We will cover topics including basic image formation, image processing, detection, matching and recognition that allow computers to understand the world based on image content.", "Description": "Learning Experience: The course will be delivered in a flipped format, with students watching recorded lectures and reading material, with the lecture functioning as a discussion session. \n\n\n\nContent: The course proceeds in five parts from foundational concepts such as image formation, through to low-level image processing operations, before building upon those to develop image representations, and use those representations for higher level tasks such as recognition and detection. The following four parts are roughly two weeks each.\n\n\n\nImage formation. The basic mathematics and physics of how images are formed based on light reflected by real-world objects. Includes ideal pinhole camera and lens models. Some basic 3D geometry, radiometry and photometry.\n\n\n\nLow-level image analysis. We will introduce basic algorithms such as convolution and filtering for image processing, and RANSAC for fitting. These will be applied for tasks such as edge detection, and line-fitting. To provide a taste of recognition students will perform shape recognition using Bayes theorem.\n\n\n\nImage Representations: To support working with more unconstrained realistic images, we next introduce feature representations for both local and global features including color histograms, HOG/SIFT, and descriptor bag of words.\n\n\n\nHigh-level image analysis: Building upon these image representations, we discuss the topical tasks of object recognition and sliding window-based object detection.\n\n\n\nApplications: Finally, we finish up with introduction to some applications including basic video processing (optical flow), and foreground detection."},
{"courseName": "Human-Computer Interaction", "EUCLID Code": "INFR11017", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11017.htm", "Acronym": "HCI", "AI": "AI", "CG": "CG", "CS": "CS", "SE": "SE", "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Dorota Glowacka", "Summary": "The design and implementation of efficient, effective and user friendly computer systems, including software objects and physical internet-enabled things, depends upon understanding both the technology and its users. Only then can designers be confident that these information appliances will be properly matched to the skills, knowledge and needs of their users. The study of Human-Computer Interaction (HCI) seeks to combine perspectives and methods of enquiry drawn from disciplines such as Interaction Design, Psychology and Sociology with the tools, techniques and technologies of Computer Science to create an approach to design which is both relevant and practical.", "Description": "* Background--the development and scope of HCI. Practical goals.\n\n* HCI relevant issues in human perception, memory and thinking processes.\n\n* Approaches to designing information appliances--software objects and physical things.\n\n* Design methodologies and notations--levels of interface design. Task analysis, grammars, state charts.\n\n* Techniques and technologies--dialogue styles, information presentation, protocols for human-to-machine and machine-to-machine interactions; mobile computing, distributed wireless computation, wireless sensors.\n\n* The design process--user involvement, iterative design, prototyping. \n\n* Evaluation--methodologies, formative and summative. Performance analysis.\n\n* Specific issues in HCI: the internet of things; novel interfaces.\n\n* A theme running through the course is the relevance of the social context on Interaction Design.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Human-Computer Interaction (HCI), Information Systems, Systems Analysis and Design"},
{"courseName": "Honours Project (Informatics)", "EUCLID Code": "INFR10044", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10044.htm", "Acronym": "PROJ", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "10", "Points": "40", "Year": "4", "Delivery": "YR", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Don Sannella", "Summary": "This is a major project and is intended to allow students to demonstrate their ability to organise and carry out a substantial piece of work. The project involves both the application of skills learnt in the past and the acquisition of new skills. Typical areas of activity will be: gathering and understanding background information; solving conceptual problems; design; implementation; experimentation and evaluation; writing up.\n\n\n\nThe project is conducted individually by the student under the supervision of a member of teaching staff. The project specification is usually provided by a member of staff, but students are also free to specify their own project. All project specifications must be approved by the Project Coordinator.\n\n\n\nFor a single honours Informatics degree, the project will normally involve the construction of an artifact, whether software, hardware, a robotic device, some other artifact incorporating computation, or some combination of these. This requirement does not necessarily apply to combined honours degrees.", "Description": "Project dependent"},
{"courseName": "HPC Architectures", "EUCLID Code": "INFR11175", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11175.htm", "Acronym": "EPCC/09", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "After taking this course students should have a good understanding (from the practioner's perspective) of the way High Performance Computing (HPC) systems are designed and how this affects both the way they are programmed and the performance of applications.", "Description": "The course will cover the following topics:\n\n\n\n- Basic components of HPC systems: processors, memory, interconnect, storage.\n\n- Classification of architectures: SIMD/MIMD, shared vs distributed memory, clusters\n\n- System software: OSs, processes, threads, scheduling, batch systems.\n\n- Brief history of HPC systems, including Moore's Law. \n\n- CPU design: functional units, instructions sets, pipelining, branch prediction, ILP (superscalar, VLIW, SIMD instructions), multithreading.\n\n- Caches: operation and design features\n\n- Memory: operation and design features, including cache coherency and consistency\n\n- Multicore CPUs, including cache and memory hierarchy\n\n- GPGPUs: operation and design features\n\n- Interconnects: operation and design features\n\n- Current HPC architectures\n\n\n\nLectures will be followed by tutored practical sessions illustrating the key concepts."},
{"courseName": "Fundamentals of Data Management", "EUCLID Code": "INFR11176", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11176.htm", "Acronym": "EPCC/08", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "Better and more effective approaches to managing digital research data are becoming increasingly important in computational science and beyond. The scientific data sets that underpin research papers can now occupy many gigabytes of storage, and are increasingly complex and challenging to work with. This course introduces students to the ideas, methods and techniques of modern, digital data management.", "Description": "The course will cover:\n\n- Why managing research data better matters, and why it's hard\n\n- Data management planning: a required part of twenty first century research\n\n- Data formats: structuring data and keeping them useful\n\n- Relational and NoSQL databases\n\n- Metadata: describing data and keeping them useful\n\n- Publication and citation of research data\n\n- Persistence, preservation and provenance of research data\n\n- Licensing, copyright and access rights: some things researchers need to know\n\n- Important distributed data processing tools and techniques, such as: Spark and MapReduce"},
{"courseName": "Foundations of Natural Language Processing", "EUCLID Code": "INFR09028", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09028.htm", "Acronym": "FNLP", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "9", "Points": "10", "Year": "3", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Alex Lascarides", "Summary": "This course covers some of the linguistic and algorithmic foundations of natural language processing. It builds on the material introduced in Informatics 2A and aims to equip students for more advanced NLP courses in years 3 or 4. The course is strongly empirical, using corpus data to illustrate both core linguistic concepts and algorithms, including language modeling, part of speech tagging, syntactic processing, the syntax-semantics interface, and aspects of semantic processing. Linguistic and algorithmic content will be interleaved throughout the course.", "Description": "1. Creating annotated corpora:\n\n* markup, annotation\n\n* evaluation measures\n\n* corpora and the web \n\n\n\n2. Lexicon and lexical processing:\n\n* language modeling\n\n* Hidden Markov Models\n\n* part of speech tagging (e.g., for a language other than English) to illustrate HMMs\n\n* Viterbi algorithm\n\n* smoothing \n\n\n\n3. Syntax and syntactic processing:\n\n* revision of context-free grammars and chart parsing\n\n* syntactic concepts: constituency, subcategorization, bounded and unbounded dependencies, feature representations\n\n* lexicalized grammar formalisms (e.g., TAG, CCG, dependency grammar)\n\n* treebanks: lexicalized grammars and corpus annotation \n\n\n\n4. Semantics and semantic processing:\n\n* compositionality\n\n* argument structure\n\n* word sense disambigution\n\n* anaphora resolution\n\n* treebanks: argument structure, WSD (e.g., Propbank, Semcor)\n\n\n\nRelevant QAA Computing Curriculum Sections: Artificial Intelligence, Natural Language Computing"},
{"courseName": "Extreme Computing", "EUCLID Code": "INFR11088", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11088.htm", "Acronym": "EXC", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Pramod Bhatotia", "Summary": "Extreme Computing deals with the principles, systems and algorithms behind Web-scale problem solving. This touches upon the technologies and techniques used by companies such as Google, Facebook, Amazon, and Microsoft, using warehouse-scale computing and massive datasets. The course will be in three parts: the principles behind extreme computing (cloud computing, scaling, performance, privacy etc.), supporting infrastructure (distributed file systems, replication, Web services etc.) and algorithms (Map/Reduce, case studies from Natural Language Processing, rudimentary data processing, machine learning, data streaming).", "Description": "The course is to be conceptually split into three main areas, with each area not necessarily accounting for an equal portion of the syllabus. The three areas and the material covered in each area are as follows:\n\n\n\n* Background: Motivation for new computing paradigms; introduction and differences between cloud and cluster computing; scaling, performance, privacy, economics, security, software as service.\n\n\n\n* Infrastructure: Distributed file systems; multi-tier systems, virtualisation; replication; fault tolerance; concurrent programming; web services.\n\n\n\n* Data structures and algorithms: decentralised data structures (e.g., peer-to-peer systems); programming frameworks (e.g., Hadoop Map/Reduce); workflow languages (e.g., FlumeJava); design and implementation of Map/Reduce programs; dealing with massive amounts of data; case studies from natural language processing, data processing, machine and deep learning; and computation over infinite streams.\n\n\n\nThe course will also deal with the legal, social, ethical, and professional issues involved in remotely storing data in cloud deployments and will also deal with potential solutions to these problems"},
{"courseName": "Dissertation (High Performance Computing)", "EUCLID Code": "INFR11166", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11166.htm", "Acronym": "EPCC/07", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "60", "Year": "5", "Delivery": "B5+", "Exam Diet": null, "Work%/Exam%": "92/8", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "The dissertation comprises a report of c.15000 words describing an MSc project undertaken between May and mid-late August applying the practical HPC skills and knowledge developed from the taught courses on MSc in High Performance Computing. Students are also required to present their work to the department.\n\n\n\nThe dissertation must be based on original work carried out solely by the candidate and conform to the University's regulations. The project work may be undertaken within the University or in an external organisation with an appropriate focus. The subject area covered by the project can, with the approval of the Programme Director, be chosen by the candidate to align with their own research interests.", "Description": "To a great extent this will depend on the specifics of the project selected by the student.\n\n\n\nResearch-level work in HPC, to include:\n\n- Critically review previous work in the area.\n\n- Plan and implement a programme of work to investigate the topic.\n\n- Analyse the results in the context of previous work.\n\n- Present the work in the form of a written dissertation.\n\n- Summarise the work in an oral presentation to an academic audience."},
{"courseName": "Dissertation (HPC with Data Science)", "EUCLID Code": "INFR11164", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11164.htm", "Acronym": "EPCC/06", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "60", "Year": "5", "Delivery": "B5+", "Exam Diet": null, "Work%/Exam%": "92/8", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "The dissertation comprises a report of c.15000 words describing an MSc project undertaken between May and mid-late August applying the practical skills and knowledge from the taught courses on MSc in HPC with Data Science. Students are also required to present their work to the department.\n\n\n\nThe dissertation must be based on original work carried out solely by the candidate and conform to the University's regulations. The project work may be undertaken within the University or in an external organisation with an appropriate focus. The subject area covered by the project can, with the approval of the Programme Director, be chosen by the candidate to align with their own research interests.", "Description": "Research-level work in Data Science, to include:\n\n- Critically review previous work in the area.\n\n- Plan and implement a programme of work to investigate the topic.\n\n- Analyse the results in the context of previous work.\n\n- Present the work in the form of a written dissertation.\n\n- Summarise the work in an oral presentation to an academic audience."},
{"courseName": "Dissertation (DSTI - EPCC) (Distance Learning)", "EUCLID Code": "INFR11185", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11185.htm", "Acronym": "EPCC/05", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "60", "Year": "5", "Delivery": "FLEX", "Exam Diet": null, "Work%/Exam%": "92/8", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "This is a major piece of independent work which forms the final stage of the MSc programme. It is intended to allow students to demonstrate their ability to organise and carry out a substantial investigation into a problem in data science, according to sound scientific principles. The project involves both the application of skills learnt in the past and the acquisition of new skills. The final submission will be expected to be at a level appropriate for an independent researcher and be a good indication of a student¿s potential to go on to be a productive researcher in a relevant sub-discipline of Data Science.\n\n\n\nThis course is only available to students on the Data Science, technology and Innovation Online Learning MSc.", "Description": "The project will be supervised by a member of academic staff from EPCC and possibly a co-supervisor appropriate to the context of the research (who may be within another part of the University or may be from an appropriate external organisation). \n\n\n\nIn this dissertation course you will be working independently on an extended piece of writing which is original and presents new research within it in the form of a sustained argument. The dissertation marks the final stage of your Masters degree and demonstrates that over the course of the programme you have gained the skills and knowledge required to engage in the formal and rigorous process of research. This process entails, but is not restricted to, identifying a suitable research topic, formulating research objectives, organising/analysing data, organising and reviewing relevant literature, devising an appropriate research methodology, reporting results, drawing conclusions and possibly even making relevant recommendations to the wider research community.\n\n\n\nThe design and conduct of the project will require a high level of commitment and application from the student. The dissertation demonstrates their ability to think scientifically and complete a research report that follows expected academic conventions of style, tone, structuring and referencing. Supervisory support will be supplemented by the detailed project handbook given to all students.\n\n\n\nThe types of activity involved in each project will vary but will include most of the following:\n\n- researching the literature and gathering background information\n\n- analysing requirements, comparing alternatives and specifying a solution\n\n- analysing and extending relevant theory in novel ways\n\n- designing and implementing the solution\n\n- experimenting with and evaluating the solution\n\n- discussing existing results and presenting new research\n\n- developing written and oral presentation skills\n\n\n\nCommunication with supervisors, including discussion progress and review of draft materials, will be determined by the student and supervisor and is most likely to be carried out by a combination of email and telephony, although all parties are encouraged to use a wiki which will be set up for each student¿s project. The wiki allows greater version control of submitted work and clearer documentation of discussions/comments than do email or telephone."},
{"courseName": "Discrete Mathematics and Mathematical Reasoning", "EUCLID Code": "INFR08023", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08023.htm", "Acronym": "DMMR", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "20", "Year": "2", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "15/85", "Lecturer(s)/Coordinator(s)": "Kousha Etessami", "Summary": "Discrete mathematics and formal mathematical reasoning.", "Description": "1) Foundations (Chapters 1 & 2 of  [Rosen])\n\n2) Basic number systems, and rudimentary algorithms on numbers and matrices (Chapter 3,  [Rosen])\n\n3) Induction and  Recursion  (Chapter 4 [Rosen])\n\n4) Basic Counting  (Chapter 5 [Rosen])\n\n5) Graphs (and binary relations):   [Chapter 9, and parts of Chapter 8]]\n\n6) Trees:  (Chapter 10 [Rosen])\n\n7) Discrete probability [Chapter 6, plus some supplementary material]"},
{"courseName": "Design and Analysis of Parallel Algorithms", "EUCLID Code": "INFR11179", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11179.htm", "Acronym": "EPCC/04", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "This module introduces theoretical design principles and analysis techniques that enable the creation and evaluation of efficient, scalable and portable algorithms for parallel computers. Concrete examples will span a range of application areas and architectural models seeking wherever possible to exploit commonality through appropriate abstraction.", "Description": "Syllabus:\n\nIntroduction: Conceptual frameworks for parallelism, message passing, shared address space, PRAM. Cost models for parallel algorithms. Cost efficiency and scalability. Inter-model emulation. Simple examples.\n\nProblem solving strategies: Embarrassing parallelism, divide & conquer, pipelining, step-by-step parallelisation. Amdahl's Law. Gustafson's law.\n\nUseful primitives: Collective communications, reduction, prefix.\n\nAlgorithms in selected problem areas, for example: Sorting (bitonic mergesort, hyperquicksort). Matrix oriented algorithms (multiplication, solving linear systems). Graph algorithms (spanning trees, single source & all-to-all shortest paths)."},
{"courseName": "Decision Making in Robots and Autonomous Agents", "EUCLID Code": "INFR11090", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11090.htm", "Acronym": "DMR", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Ram Ramamoorthy", "Summary": "This course is intended as a specialized course on models and techniques for decision making in autonomous robots that must function in rich interactive settings involving interactions with a dynamic environment, and other agents (e.g., people). In the first part of the course, students will learn about formal models of decision making, and computational methods for automating these decisions within robots. In the second part of the course, we will consider issues arising in practical deployments of such autonomous robots, including problems of achieving safety, explainability and trust. Students will be exposed to current thinking on models and algorithmic methods for achieving these\n\nattributes in autonomous robots.\n\n\n\nThe content of this course has connections to other courses within our existing curriculum, such as Reinforcement Learning and Algorithmic Game Theory. A noteworthy difference is that RL and AGTA are primarily focussed on broad coverage of algorithmic methods, whereas this course will emphasize issues of modelling, with some focus on problems arising in practical robotics applications.", "Description": "The course will cover the following major themes, although specific topics could vary from year to year.\n\n\n\nI. Motivation\n\n\n\na. Problems involving interaction: Strategically rich human-robot\n\ninteraction; Multi-robot interactions\n\n\n\nb. How have decisions been modelled in different disciplines: probability\n\ntheory, machine learning, psychology and cognitive science\n\n\n\n\n\nII. Mathematics of decisions\n\n\n\na. The utility maximization framework, Bayesian choice models\n\n\n\nb. Causality, Causal learning\n\n\n\nc. Bandit problems, Markov Decision Processes, and associated analysis\n\nmethods\n\n\n\nd. Dynamic programming principle, and associated approximation and\n\nlearning algorithms\n\n\n\ne. Incomplete information, Game theoretic models and solution concepts\n\n\n\n\n\nIII. Computer science of decisions\n\n\n\na. Representations for planning - tradeoffs in modelling hierarchy,\n\nuncertainty, etc.\n\n\n\nb. Safety and trust in autonomous systems\n\n\n\nc. Explainability in AI\n\n\n\nd. Bounded rationality and cognitive biases\n\n\n\n\n\nRelevant QAA Computing Curriculum Sections: Artificial Intelligence, Intelligent Information Systems Technologies."},
{"courseName": "Database Systems", "EUCLID Code": "INFR10070", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10070.htm", "Acronym": "DBS", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "10", "Points": "20", "Year": "3", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Paolo Guagliardo", "Summary": "Databases are essential to maintaining the information base in almost all modern business enterprises and to electronic commerce. They are also becoming increasingly important as a fundamental tool in much scientific research. Some knowledge of databases is now essential in any of these areas. The study of databases draws on several disciplines within computer science: logic, algorithms, programming languages and operating systems.\n\n\n\nThis course is an introduction to the principles underlying the design and implementation of databases and database management systems. It will cover the theoretical and practical languages that have been developed for relational databases, their implementation and optimisation. It will also cover transaction processing and concurrency control, as well as tools and techniques for decision support and data analysis. In addition, some recent developments in databases, including semistructured data and the relationship between relational databases and XML documents, will be introduced.\n\n\n\nThis 20 credit course replaces INFR10055 Database Systems (10 credits).", "Description": "- Overview of database management systems and the relational model\n\n - Database design: E-R diagrams, constraints, normal forms\n\n - Query languages: relational algebra and calculus\n\n - SQL: data definition, data manipulation, queries, views, constraints, triggers\n\n - Database access from applications: embedded and dynamic SQL\n\n - Storage and indexing: B-trees, hashing\n\n - Query evaluation and optimisation: join strategies, query plans\n\n - Scheduling and concurrency control: transaction management,\n\nserializability, locking\n\n - Data warehousing and decision support: OLAP, view materialisation and maintenance\n\n - Deductive databases: Datalog and recursive queries\n\n - Incomplete data: null values and certain answers\n\n - Semistructured data: XML documents, DTDs, query languages for XML"},
{"courseName": "Data Science, Technology and Innovation Dissertation (Distance Learning)", "EUCLID Code": "INFR11159", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11159.htm", "Acronym": "DISS-DSTI", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "60", "Year": "5", "Delivery": "FLEX", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Bob Fisher", "Summary": "*This course is for students on the 'Data Science, Technology and Innovation' programme, choosing to do an Informatics based MSc project*.\n\n\n\nThis is a major piece of full-time independent work. It is intended to allow students to demonstrate their ability to organise and carry out a substantial investigation into a problem in Informatics, according to sound scientific and engineering principles. The project involves both the application of skills learnt in the past and the acquisition of new skills.\n\n\n\nThe types of activity involved in each project will vary but will include most of the following:\n\n\n\n* Researching the literature and gathering background information.\n\n* Analysing requirements, comparing alternatives and specifying a solution.\n\n* Analysing and extending relevant theory in novel ways.\n\n* Designing and implementing the solution.\n\n* Experimenting with and evaluating the solution.\n\n* Discussing existing results and presenting new research.\n\n* Developing written and oral presentation skills.\n\n\n\nThe project is conducted individually by the student under the supervision of a member of teaching staff. Students are formed into groups for the purpose of a Review Meeting.", "Description": "Project Dependant."},
{"courseName": "Data Mining and Exploration", "EUCLID Code": "INFR11007", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11007.htm", "Acronym": "DME", "AI": "AI", "CG": "CG", "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "50/50", "Lecturer(s)/Coordinator(s)": "Arno Onken", "Summary": "The aim of this course is to discuss modern techniques for analyzing, interpreting, visualizing and exploiting the data that is captured in scientific and commercial environments. The course will develop the ideas taught in various machine learning courses and discuss the issues in applying them to real-world data sets, as well as teaching about other techniques and data-visualization methods. The course will also feature case-study presentations and each student will undertake a mini-project on a real-world dataset.", "Description": "The course will consist of two parts, the first part being a series of lectures on what is outlined below. It is anticipated that there will also be one or two guest lectures from data mining practitioners.\n\n\n\nThe second part will consist of student presentations of papers relating to relevant topics. Students will also carry out a practical mini-project on a real-world dataset. For both paper presentations and mini-projects, lists of suggestions will be available, but students may also propose their own, subject to approval from the instructor.\n\n\n\n* Introduction, overview\n\n* Data preprocessing and cleaning, dealing with missing data\n\n* Data visualization, exploratory data analysis\n\n* Data mining techniques\n\n* Predictive modelling techniques (e.g. SVMs)\n\n* Performance evaluation (e.g. ROC curves)\n\n* Issues relating to large data sets\n\n* Application areas, e.g. text mining, collaborative filtering, retrieval-by-content, web mining, bioinformatics data, astronomy data \n\n\n\nRelevant QAA Computing Curriculum Sections:  Artificial Intelligence"},
{"courseName": "Data Analytics with High Performance Computing", "EUCLID Code": "INFR11171", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11171.htm", "Acronym": "EPCC/03", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "0/100", "Lecturer(s)/Coordinator(s)": "not allocated", "Summary": "Data Analytics, Data Science and Big Data are  just a few of the many topical terms in business and academic research, all effectively referring to the manipulation, processing and analysis of data. Fundamentally, these are all concerned with the extraction from data of knowledge that can be used for competitive advantage or to provide scientific insight. In recent years, this area has undergone a revolution in which HPC has been a key driver, as evidenced by the vast clusters that power Google and Amazon as well as the supercomputing tiers analysing the outputs from the Large Hadron Collider. This course provides an overview of data science and the analytical techniques that form its basis as well as exploring how HPC provides the power that has driven their adoption.", "Description": "The course will cover:\n\n- Key data analytical techniques such as, classification, optimisation, and unsupervised learning\n\n- Key parallel patterns, for implementing analytical techniques\n\n- Relevant HPC and data infrastructures\n\n- Case studies from academia and business"},
{"courseName": "Computer Security", "EUCLID Code": "INFR10067", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10067.htm", "Acronym": "CS", "AI": null, "CG": null, "CS": "CS", "SE": "SE", "Level": "10", "Points": "20", "Year": "3", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Myrto Arapinis", "Summary": "Computer Security is concerned with the protection of computer systems and their data from threats which may compromise integrity, availability, or confidentiality; the focus is on threats of a malicious nature rather than accidental. This course aims to give a broad understanding of computer security. Topics include security risks, attacks, prevention and defence methods; techniques for writing secure programs; an overview of the foundations for cryptography, security protocols and access control models.\n\n\n\n This course replaces INFR10058 Computer Security (10 credits).", "Description": "The  goal  of  this  course  is  to  introduce  students  to  fundamental  security concepts and offer them working knowledge of threats and counter-measures.\n\n\n\nThe topics covered in the course are:\n\n\n\n¿ Introduction:   fundamental  concepts,  access  control  models,  threat\n\nmodelling. \n\n\n\n¿ Network security: basic networking concepts, DoS, Transport layer security, Link layer security, DNS attacks, Firewalls, Intrusion detection.\n\n\n\n¿ Usable  security:  basic  human  factors,  warning  design,  phishing,  authentication, device authentication.\n\n\n\n¿ Cryptography:   symmetric  ciphers,  asymmetric  ciphers,  MACs  and\n\nhash functions, digital signatures.\n\n\n\n¿ Cryptographic protocols:  identification, authentication and key agreement, SSL/TLS, anonymity protocols, TOR.\n\n\n\n¿ OS security:  OS concepts, memory and file system, access control, file\n\npermissions, memory safety, stack-based buffer overflows.\n\n\n\n¿ Malware:  viruses, trojan horses, worms, rootkits.\n\n\n\n¿ Web security: WWW basics, client-side attacks, session hijacking XSS,\n\nCSRF, defences, server-side attacks, SQL injection, RFI, LFI."},
{"courseName": "Computer Programming Skills and Concepts", "EUCLID Code": "INFR08022", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr08022.htm", "Acronym": "CP", "AI": null, "CG": null, "CS": null, "SE": null, "Level": "8", "Points": "20", "Year": "1", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Cristina Alexandru", "Summary": "This course introduces basic skills required to develop computer programs using modern computer systems, assuming little or no previous experience. It also introduces fundamental concepts of program construction in a suitable high-level programming language.  The course has a significant practical component requiring students to construct small programs.", "Description": "Introduction: \n\n  Elements of a modern computer system and computing environment. \n\n  UNIX, its file system and programming utilities.\n\n\n\nProgram design and development: \n\n  Specification, problem decomposition. Reasoning about and testing programs.\n\n\n\nProgramming in ANSI C: \n\n  Expressions, types, variables, assignment, conditionals, iteration, arrays, strings, files, functions.\n\n\n\nStructured programming:  \n\n  Functional and procedural abstraction, headers and libraries, name and scope."},
{"courseName": "Computer Design", "EUCLID Code": "INFR09046", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09046.htm", "Acronym": "CD", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "9", "Points": "20", "Year": "3", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Nigel Topham", "Summary": "This course provides an introduction to the fundamental concepts of the different ways computers can be analysed and designed. The course does not look at the differences between machines with different types of instruction set, nor does it cover design techniques for extracting maximum performance from computers - these aspects of computer hardware are covered in the Computer Architecture course. The issues and techniques covered in the Computer Design course are relevant to the design of all computers, regardless of their particular architecture.\n\n\n\nThe course is partitioned into three sections. The short first section revises the design of combinational and sequential logic. The second section demonstrates how to analyse and design systems of the complexity of a simple CPU or I/O controller. The third section of the course covers the design of a complete computer capable of executing assembly code programs and different control strategies for performing I/O.", "Description": "Logic Design Revision Simple combinational logic design to state machines for sequential circuits.\n\n\n\nProcessor Design Data path and control. Fixed program controllers: example and design procedure. Instruction set processors: data path design, simple control, microprogrammed control. ALU design: addition, ripple carry and look ahead adders, negative numbers & subtraction; multiplication sequential multiplier, modification for 2's complement, combinational multiplier, division. Floating point numbers: addition, multiply and divide, implementations.\n\n\n\nComputer Systems Memory: Byte vs. word addressing, memory system design, error detection and correction. I/O Design: I/O controller design. Connection of I/O controllers to CPU, synchronization of I/O and CPU, polling, interrupts. Direct Memory Access, bus arbitration, DMA controller implementation. I/O processors. Synchronous and asynchronous buses. Simple performance enhancements to the basic architecture. RISC."},
{"courseName": "Computer Communications and Networks", "EUCLID Code": "INFR10074", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr10074.htm", "Acronym": "COMN", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "10", "Points": "20", "Year": "3", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Mahesh Marina", "Summary": "This is a comprehensive first course in Computer Communications and Networks, focusing on fundamental concepts, principles and techniques. The course will introduce basic networking concepts, including: protocol, network architecture, reference models, layering, service, interface, multiplexing, switching and standards. An overview of digital communication from the perspective of computer networking will also be provided. Topics covered in this course include: Internet (TCP/IP) architecture and protocols, network applications, congestion/flow/error control, routing and internetworking, data link protocols, error detection and correction, channel allocation and multiple access protocols, communication media and selected topics in wireless and data centre networks. It will cover recent advances in network control and management architectures by introducing the concepts of software-defined networking (SDN) and network (function) virtualisation. Students taking this course will gain hands-on experience in network programming using the socket API; network traffic/protocol analysis; and on assessment of alternative networked systems and architectures.", "Description": "* Introduction to Computer Networking and the Internet\n\n* Digital Communication Basics\n\n* The Application Layer with comprehensive treatment of networked applications (incl. multimedia data and applications)\n\n* The Transport Layer\n\n* The Network Layer\n\n* The Data Link Layer\n\n* The Medium Access Control Sub-Layer\n\n* The Physical Layer\n\n* Software-defined networking (SDN)\n\n* Network virtualisation and network function virtualisation (NFV)\n\n* Network management\n\n* Introduction to data centre and wireless networks\n\n* Overview and selected aspects of network security"},
{"courseName": "Computer Animation & Visualisation", "EUCLID Code": "INFR11067", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11067.htm", "Acronym": "CAV", "AI": "AI", "CG": "CG", "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Sebastian Starke", "Summary": "Two major topics of Visualisation and Computer Animation are covered in this course.\n\n\n\nVisualization is a cognitive process using the powerful information processing and analytical functions of the human vision system. It has always been a major factor in scientific progress and now, with the assistance of computer graphics, it extends our vision system from sub-atomic to interstellar dimensions and allows geometric representations and simulations of any multidimensional dataset. The fundamental objective is to acquire new knowledge rather than generating pictures. This part is very practical and techniques will be illustrated with applications in the scientific, engineering and medical domains. The increasingly important field of information visualisation and visual data-mining will also be covered.\n\n\n\nThe computer animation part will focus mainly on technological aspects for 3D computer animation for applications such as games and virtual environments. Techniques of character animation such as synthesizing their body movements, facial expressions and skin movements, and behaviors in crowded scenes, and how to compress such data will be first covered. Other topics which are essential to create natural scenes, such as physically based simulation for clothes, fluids and particles will also be covered.", "Description": "* Visualisation: definition and motivation.\n\n* Data representation: geometric abstractions; volume and surface representations, interpolation.\n\n* Fundamental algorithms: colour mapping; contouring; glyphs; volume rendering.\n\n* Advanced algorithms: flow visualisation, vector visualisation, tensor visualisation.\n\n* Information visualisation: networks and trees; document visualisation.\n\n* Advanced topics of Computer Graphics: Visualisation of environments, data processing.\n\n* Character Animation techniques: keyframe animation, inverse kinematics, facial animation, PD-control, flocking, crowd simulation.\n\n* Motion capture technologies: optical, magnetic, mechanical, gyrosensors.\n\n* Optimization-based techniques: space-time constraints, Laplacian distance shape deformation.\n\n* Physically based animation techniques: fluid animation, hair animation, cloth simulation, deformable objects.\n\n\n\nRelevant QAA Computing Curriculum Sections: Relevant QAA Computing Curriculum Sections: Artificial Intelligence, Computer Based Systems, Data Structures and Algorithms, Developing Technologies, Graphics and Sound, Human-Computer Interaction (HCI)."},
{"courseName": "Computer Algebra", "EUCLID Code": "INFR11111", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11111.htm", "Acronym": "CA", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "20/80", "Lecturer(s)/Coordinator(s)": "Kyriakos Kalorkoti", "Summary": "Computer graphics uses various shapes such as ellipsoids for modelling. Consider the following problem: we are given an ellipsoid, a point from which to view it, and a plane on which the viewed image is to appear. The problem is to find the contour of the image as an equation (a numerical solution is not good enough for many applications).  The problem does not involve particularly difficult mathematics, but a solution by hand is very difficult. This is an example of a problem that can be solved fairly easily with a computer algebra system. These systems have a very wide range of applications and are useful both for routine work and research. From a computer science point of view they also give rise to interesting problems in implementation and the design of algorithms. The considerations here are not only theoretical but also pragmatic. The design of efficient algorithms in this area involves various novel techniques.\n\nThe course addresses the underlying principles and supporting mathematics by considering a few key areas and algorithms. There is also emphasis on developing an intuitive understanding of techniques. There is a two way process in which the desire to solve mathematical problems motivates the design of new algorithms and in turn the process of designing algorithms motivates supporting mathematical material. The course uses the open source computer algebra system Axiom to support coursework and as an example of algorithms in practice.", "Description": "* Axiom: general design principles, user facilities, data structures, domains, etc.\n\n* Brief comparison of systems.\n\n* Algebraic structures: overview, basic concepts and algorithms.\n\n* Arbitrary precision operations on integers, rationals, reals, polynomials and rational expressions.\n\n* Importance of greatest common divisors and their efficient computation for integers and univariate polynomials (using modular methods).\n\n* Multivariate polynomial systems: solution of sets of equations over the complex numbers; construction and use of Groebner bases; relevant algebraic structures and results.\n\n* Reliable solution of systems of polynomial equations in one variable; Sturm sequences, continued fractions method.\n\n\n\nRelevant QAA Computing Curriculum Sections: Data Structures and Algorithms, Simulation and Modelling, Theoretical Computing"},
{"courseName": "Computational Complexity", "EUCLID Code": "INFR11102", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11102.htm", "Acronym": "CMC", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "25/75", "Lecturer(s)/Coordinator(s)": "Heng Guo", "Summary": "This module studies the problem of classifying computational problems according to their intrinsic difficulty or 'complexity'. We begin by defining a standard computational model, the Turing machine, which is useful for abstracting out complexity aspects of computational problems. We define various complexity resources, such as time, space, non-determinism , randomness and non-uniformity, and learn how to classify computational problems according to their resource requirements. Among other topics, we discuss the central problem of theoretical computer science, the P vs NP problem, and explain its importance using the notions of reductions and completeness.", "Description": "* The computational model: Turing machines\n\n* NP and NP completeness\n\n* Space complexity\n\n* Diagonalization\n\n* The polynomial hierarchy\n\n* Circuits\n\n* Randomized computation\n\n* Counting complexity\n\n\n\nRelevant QAA Computing Curriculum Sections: Concurrency and Parallelism, Data Structures and Algorithms, Theoretical Computing"},
{"courseName": "Case Studies in Design Informatics 2", "EUCLID Code": "INFR11095", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11095.htm", "Acronym": "CDI2", "AI": "AI", "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Maria Wolters", "Summary": "How would you help the next generation of Design Informatics students avoid the mistakes you made? Every time a decision is made to pursue one course of action, other routes are closed off. The goal is to lead a group of fresh thinkers to see why you made particular project design decisions, and to help them map out a different service or product that could be built from the same components.", "Description": "This course extends students' engagement with real examples in the emerging field of Design\n\nInformatics. A key component of the course is the detailed evaluation and rationale behind several current research projects that highlight the limitations of the state of the art, or novel use of the latest theories and technologies. The primary learning outcome is the development of specialist reflective and leadership skills that can then be exploited in future industrial application or academic research into Design Informatics.\n\nThe senior students following this course as part of a two-year masters complete a compulsory summer placement, and then work with junior students (normally, who are enrolled in CSDI1).\n\nThe syllabus divides into three parts.\n\n- In Part 1, students complete a summer internship placement and are then debriefed on it in a series of tutorials in the beginning of the year\n\n- In Part 2, students support junior students (typically enrolled in CSDI1) in their group case studies. This support can take a variety of forms, from mentoring a group of younger students to providing training and support in specialist techniques.\n\n- In Part 3, concurrently to the support provided to junior students, the students are mentored on their final Masters thesis, similar to the Informatics Research Proposal (INFR11137). This mentoring is in addition to the work students do with their supervisors and will cover key skills required to complete a Masters thesis\n\nFor Parts 1 and 3, a mix of tutorials and lectures are used."},
{"courseName": "Case Studies in Design Informatics 1", "EUCLID Code": "INFR11094", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11094.htm", "Acronym": "CDI1", "AI": "AI", "CG": "CG", "CS": "CS", "SE": null, "Level": "11", "Points": "20", "Year": "5", "Delivery": "S1", "Exam Diet": null, "Work%/Exam%": "100/0", "Lecturer(s)/Coordinator(s)": "Maria Wolters", "Summary": "How would you do it differently? Every time a design decision is made to pursue one course of action, other routes are closed off. The goal is to work in groups to see why specific project design decisions were taken, and to envisage a different service or product that could be built from the same components.", "Description": "Students work in groups. In the second part, they are supported by senior students (normally,\n\nthose who are enrolled in CSDI2), with a member of academic staff as mentor.\n\n\n\nThis course introduces students to real examples in the emerging field of Design Informatics. A key\n\ncomponent of the course is the detailed evaluation of and rationale behind multiple current\n\nresearch projects that highlight the limitations of the state of the art, or novel use of the latest\n\ntheories and technologies.\n\n\n\nThe syllabus divides into two phases.\n\n- In the first part of the course, a core case study is introduced via lectures where a product or\n\nservice is an important deliverable.\n\n- In the second part of the course, each group works on its own, new case study, justifies its\n\nselection and scoping, produces a prototype and conducts a short experimental study based on\n\nthat prototype.\n\n\n\nWherever possible, case studies are taken from the ongoing or recent research at the University of\n\nEdinburgh. The case studies will be underpinned with lectures reviewing relevant theoretical\n\nbackground and classroom activities to ensure students develop required skills. Formative\n\nfeedback will be through class interaction and self- or peer assessed quizzes."},
{"courseName": "Blockchains and Distributed Ledgers", "EUCLID Code": "INFR11144", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11144.htm", "Acronym": "BDL", "AI": null, "CG": null, "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "VUG: December; April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Aggelos Kiayias", "Summary": "Blockchain technology and distributed ledgers have been hailed as a turning point in scaling information technology services at a global level. Although the digital currency Bitcoin is the best-known Blockchain application today, the technology is set to play a much broader role in cyber security innovation. This course is an introduction to the design and analysis of blockchain systems and distributed ledgers and is meant to be taught in parallel to the Introduction to Modern Cryptography course of the same level (INFR11131) every other year (with the latter course as a prerequisite  or co-requisite).", "Description": "The concept of blockchain will be covered in detail together with the supporting cryptographic technology. Questions that will be covered is why it works and what problems can it solve. \n\n\n\nSyllabus:\n\n\n\n1. Introduction to blockchain. What is a distributed ledger. Transactions. Digital Signatures.\n\n2. The consensus layer. Basic Properties. Proof of Work.\n\n3. Robust Transaction Ledgers. Properties and Objectives. Permissioned, permissionless ledgers. \n\n4. Privacy Issues. Anonymity, Pseudonymity, Unlinkability. Zero-Knowledge Proofs.\n\n5. Scalability Issues. Byzantine agreement protocols. \n\n6. Blockchain as a platform. Smart Contracts. \n\n7. Secure multiparty computation techniques and their application to blockchain protocols. \n\n8. Alternative techniques to proof of work for blockchain protocols, proof of stake/space. \n\n9. Game theoretic analysis of blockchain protocols. \n\n10. Name and object registries. Reputation systems. Policy issues related to blockchain."},
{"courseName": "Bioinformatics 2", "EUCLID Code": "INFR11005", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11005.htm", "Acronym": "BIO2", "AI": "AI", "CG": "CG", "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "5", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Douglas Armstrong", "Summary": "Bioinformatics is at the interface between two of the most influential scientific fields. An appreciation of computational and biological sciences, in particular the terminology employed in both fields, is essential for those working at such an interface. In this course, we aim to cover the following:\n\n\n\n* The concepts of computer science that relate to problems in biological sciences.\n\n* Commercial and academic perspectives on bioinformatics.\n\n* The impact of bioinformatics on the methodologies used in biological science.\n\n* The influence biological science has on computing science.", "Description": "The course will cover the following:\n\n\n\n* Next generation sequencing technologies\n\n* Machine learning algorithms for sequence analysis\n\n* Computational assembly of genomic sequences\n\n* Gene finding\n\n* Advanced functional genomics, expression analysis\n\n* Industry guest lecture\n\n* The future of bioinformatics: proteomics, neuroinformatics, e-science.\n\n\n\nRelevant QAA Computing Curriculum Sections:  Data Structures and Algorithms, Developing Technologies"},
{"courseName": "Bioinformatics 1", "EUCLID Code": "INFR11160", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11160.htm", "Acronym": "BIO1", "AI": "AI", "CG": "CG", "CS": "CS", "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S1", "Exam Diet": "December", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Douglas Armstrong", "Summary": "**This course replaces Bioinformatics 1 (INFR11016)**\n\n\n\nA primary requisite for relevant, and efficient, research in Bioinformatics is that scientists from both fields (biology and informatics) are involved, or consulted. Team work can only be successful if all parties have a basic ground knowledge of the respective other field and, most importantly, that they can communicate with each other. The aims of the course are to help you overcome both of these difficulties in your future careers. The course will cover topics that include core biology concepts that relate to bioinformatics, biological data and their source and structure as well as common tools for their analysis.\n\nThe course will also involve group-based practical work on using and developing bioinformatics solutions.", "Description": "The course will cover the following:\n\n\n\nEssential Biology\n\n* DNA/proteins\n\n* Evolution\n\n* Chromosomes and Cells\n\n* Molecular structures\n\n\n\nBioinformatics\n\n* Biological sequence analysis and alignment\n\n* Bioinformatics resources and databases\n\n* Functional genomics\n\n* Proteomics and network analysis\n\n* a site visit to see bioinformatics research in action\n\n\n\n\n\nRelevant QAA Computing Curriculum Sections: Databases, Developing Technologies"},
{"courseName": "Automatic Speech Recognition", "EUCLID Code": "INFR11033", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr11033.htm", "Acronym": "ASR", "AI": "AI", "CG": "CG", "CS": null, "SE": null, "Level": "11", "Points": "10", "Year": "4", "Delivery": "S2", "Exam Diet": "April/May", "Work%/Exam%": "30/70", "Lecturer(s)/Coordinator(s)": "Steve Renals", "Summary": "This course covers the theory and practice of automatic speech recognition (ASR), with a focus on the statistical approaches that comprise the state of the art. The course introduces the overall framework for speech recognition, including speech signal analysis, acoustic modelling using hidden Markov models, language modelling and recognition search. Advanced topics covered will include speaker adaptation, robust speech recognition and speaker identification. The practical side of the course will involve the development of a speech recognition system using a speech recognition software toolkit.", "Description": "* Signal analysis for ASR\n\n* Statistical pattern recognition (Bayes decision theory, Learning algorithms, Evaluation methods, Gaussian mixture model, and EM algorithm)\n\n* Hidden Markov Models (HMM)\n\n* Context-dependent models\n\n* Discriminative training\n\n* Language models for LVCSR (large vocabulary continuous speech recognition)\n\n* Decoding\n\n* Robust ASR (Robust features Noise reduction, Microphone arrays)\n\n* Adaptation (Noise adaptation, Speaker adaptation/normalization, Language model adaptation)\n\n* Speaker recognition\n\n* History of speech recognition\n\n* Advanced topics (Using prosody for ASR, Audio-visual ASR, Indexing, Bayesian network)\n\n* speech recognition applications (including privacy implications)\n\n\n\nRelevant QAA Computing Curriculum Sections:   Artificial Intelligence, Natural Language Computing"},
{"courseName": "Automated Reasoning", "EUCLID Code": "INFR09042", "Course URL": "http://www.drps.ed.ac.uk/18-19/dpt/cxinfr09042.htm", "Acronym": "AR", "AI": "AI", "CG": "CG", "CS": "CS", "SE": null, "Level": "9", "Points": "10", "Year": "3", "Delivery": "S1", "Exam Diet": "April/May; VUG: December", "Work%/Exam%": "40/60", "Lecturer(s)/Coordinator(s)": "Jacques Fleuriot", "Summary": "The overall aim of the course is to describe how reasoning can be modelled using computers. Its more specific aim is to provide a route into more advanced uses of theorem proving in order to solve problems in mathematics and formal verification.\n\n\n\nMajor emphases are on: how knowledge can be represented using propositional, first-order and higher-order logic; how these representations can be used as the basis for reasoning, and how these reasoning processes can be guided to a successful conclusion through a variety of means ranging from fully-automated to interactive ones. Students will develop a thorough understanding of modern, interactive theorem proving via lectures, tutorials and an assignment.  \n\n\n\nThis course will replace Automated Reasoning (Level 11) (INFR11074).", "Description": "The course starts with an introduction to higher order logic, theorem provers and, more specifically, Isabelle/HOL. This will set the context for the rest of the course in which Isabelle will be the framework for getting hands-on experience about the application of various theoretical concepts.\n\nThrough the lectures and tutorials that incorporate practical exercises the students will gain the skills needed to get started with Isabelle and progress to more complex concepts involving both representation and reasoning.\n\n\n\nThe second part will look at representation/modelling of concepts in (higher order) logic in details.  Axiomatic versus conservative extensions of theories will be covered and mechanisms such as Isabelle locales will be introduced and used. Recursive definitions and inductive notions will be covered too.\n\n\n\nThe third part of the course will focus on fundamental notions such as unification and rewriting, within both a first and higher order context. It will look at notions such as termination and use Isabelle's simplifier as the tool for understanding many of the concepts. It will also look at the interplay between (fully) automatic and interactive proofs.\n\n\n\nThe fourth part will introduce declarative/structured proofs and using the Isar language of Isabelle show how proofs resembling pencil and paper ones can be formalized.\n\n\n\nFinally the various strands will brought together through the discussion of a non-trivial case study.\n\nThis may involve either formalized mathematics (e.g. looking at a geometric theory) or a formal verification example.\n\n\n\nThe assignment will be a combination of basic to intermediate representation and reasoning in Isabelle (up to 40%), more advanced proof tackling one particular domain or example (up to 40%) and a final part which, if completed successfully, will clearly demonstrate that the student has a good of the challenges that advanced interactive theorem proving entails."}
]